src/post_tonal_overtone/org_files/first-steps.org
* starting-up--basics
When viewing this in emacs org-mode, you will see results for running
any block code; however, these results will not appear on the github
wiki (unless you click the 'Raw' tab at the top).

** namespaces
A big part of really understanding how to build things in Clojure is
to understand namespaces. Learning about what namespaces are--and
importantly, what's available to you "in" different namespaces--is a
step that cannot be emphasized enough at the early stages of learning.
*** starting up from a .clj source file
The key here will be having an functioning cider-repl open and
evaluating a main source file. In emacs, this involves visiting the
~post_tonal_definitions.clj~ file in my
post_tonal_overtone/src/post_tonal_overtone directory. (Note, the
leiningen build template involves installing a basic core.clj file.
Learning how to best use this is not obvious at first).

But, even more significantly, you will want to develop a strong
concept of how to instantiate a namespace, and how to load in any code
you want to be working with from WITHIN the namespace declaration.

Here's one good example (note, the presence of overtone.live on your
machine or in your files is no minor thing! There should be a link to 
how to best deal with this for those times when you are starting up a
system that hasn't had overtone working for it yet. The simplest
answer is to--once this project is cloned--navigate to the directory
containing it and start up your lein repl/cider-jack-in from there.

Note that the first time you do this, there may be a lot of stuff to
download! You can also simply just:

#+BEGIN_SRC clojure
(use 'overtone.live)
#+END_SRC
)

#+BEGIN_SRC clojure
(ns post_tonal_overtone.core
  (:use overtone.live)
  (:require [post_tonal_overtone.data.set_class_data :as set-class]))
#+END_SRC
Here's a slightly more messed up one. Can you spot the differences,
subtle and obvious?

#+BEGIN_SRC clojure
(ns post-tonal-overtone.core
  (:use overtone.live
        overtone.inst.sampled-piano

        ;;	post-tonal-overtone.set-class-data
        ;;	post-tonal-overtone
        ;;	org.clojure/math.combinatorics "0.1.1"
        ;; is it necessary to load .repl?
        ;; if you want to call 'dir' and such un-prefixed
        ;;	clojure.repl
        )
  (:require [post_tonal_overtone.data.set_class_data :as set-class]
            [post_tonal_overtone.core :as pt]))
#+END_SRC
*** calling dir
If you want to get a sense of what you have been bringing in, and want
to begin to get a sense of how namespaces really work, take a look at
what may be defined in a given namespace.
**** (dir post_tonal_overtone.core)
Note, this will not necessarily produce the same results as below.
Why? What has to happen for all my nice handiwork to be loaded?
#+BEGIN_SRC clojure :results output
(dir post_tonal_overtone.core)
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
a
actual-melody
append-to
b
bpm
chord-progression-time1
chord-progression-time10
chord-progression-time2
chord-progression-time3
chord-progression-time4
chord-progression-time5
chord-progression-time6
chord-progression-time7
chord-progression-time8
chord-progression-time9
do-re-mi
event-list
event-list1
from
looper
m
med96
metro
mod12
my-chord-progression-time
my-ctford-play
my-play
new-play
noisey-sustained
noisey2
piano-dissonances3
play
play-chord-saw1
play-chord-sin2
play-piano-chord
play-piano-dissonances2
play-piano-dissonances3
play-quieter-piano-chord
random-sample
saw-diss
saw1
scale-degrees
sin3
sine-tetra-diss
some-midis
stateful-chord
tetrachord-piano-dissonances2
voice-and-transpose-rand-set
voice-rand-set
where
#+END_EXAMPLE
**** (dir post_tonal_overtone.data.set_class_data)
#+BEGIN_SRC clojure :results output
(dir post_tonal_overtone.data.set_class_data)
#+END_SRC

#+RESULTS:
#+begin_example
cmajtriads
dyads
dyads-tn
hexachords
hexachords-tn
nested-transposed-tetrachords
pentachords
pentachords-tn
tetrachords
tetrachords-tn
trichords
trichords-tn
#+end_example
**** (dir post_tonal_overtone.probability_functions.finite-distributions)
#+BEGIN_SRC clojure :results output
(dir post_tonal_overtone.probability_functions.finite-distributions)
#+END_SRC

#+RESULTS:
#+begin_example
bernoulli
binomial
certainly
choose
cond-dist-m
cond-prob
dist-m
join-with
make-distribution
normalize
normalize-cond
prob
select
uniform
zipf
#+end_example
**** overtone.live
#+BEGIN_SRC clojure :results output
(dir overtone.live)
#+END_SRC

#+RESULTS:
