src/post_tonal_overtone/org_files/html-versions/first-steps.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-02 Fri 15:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="b" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline17">1. starting-up&#x2013;basics</a>
<ul>
<li><a href="#orgheadline11">1.1. namespaces</a>
<ul>
<li><a href="#orgheadline1">1.1.1. starting up from a .clj source file</a></li>
<li><a href="#orgheadline8">1.1.2. calling dir</a></li>
<li><a href="#orgheadline9">1.1.3. simple namespaces moves</a></li>
<li><a href="#orgheadline10">1.1.4. eventually more complex, as you realize what your work will require</a></li>
</ul>
</li>
<li><a href="#orgheadline16">1.2. test sound</a>
<ul>
<li><a href="#orgheadline12">1.2.1. a definst template (noise, non-pitched)</a></li>
<li><a href="#orgheadline13">1.2.2. definst can take an envelope for scaling the ugen output&#x2013;using lin</a></li>
<li><a href="#orgheadline14">1.2.3. scale output using an env-gen</a></li>
<li><a href="#orgheadline15">1.2.4. define constant pink noise</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline23">2. shaping some basic sounds</a>
<ul>
<li><a href="#orgheadline19">2.1. play long white noise</a>
<ul>
<li><a href="#orgheadline18">2.1.1. example&#x2013;10 second version, long release?</a></li>
</ul>
</li>
<li><a href="#orgheadline20">2.2. build some 'pitched' synth instruments for playing chords</a></li>
<li><a href="#orgheadline21">2.3. saw waves are harmonically rich&#x2013;sine waves not so much&#x2026;</a></li>
<li><a href="#orgheadline22">2.4. here's a use of a built-in overtone library for making choices algorithmically</a></li>
</ul>
</li>
<li><a href="#orgheadline31">3. begin creating scheduled events</a>
<ul>
<li><a href="#orgheadline25">3.1. basic example</a>
<ul>
<li><a href="#orgheadline24">3.1.1. use 'at' to schedule chord events</a></li>
</ul>
</li>
<li><a href="#orgheadline27">3.2. schedule a single event</a>
<ul>
<li><a href="#orgheadline26">3.2.1. test out single event versions using 'at'</a></li>
</ul>
</li>
<li><a href="#orgheadline30">3.3. how do we establish a beat for scheduling events using metronome?</a>
<ul>
<li><a href="#orgheadline28">3.3.1. Preparing dissonant chords</a></li>
<li><a href="#orgheadline29">3.3.2. Schedule dissonant chords</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline44">4. miscellaneous experiments</a>
<ul>
<li><a href="#orgheadline35">4.1. Experiment with progression based on sawtooth synths</a>
<ul>
<li><a href="#orgheadline32">4.1.1. use sawtooth synths to play various chords</a></li>
<li><a href="#orgheadline33">4.1.2. chord progression number 3&#x2013;sawtooth intensive</a></li>
<li><a href="#orgheadline34">4.1.3. chord progression 4</a></li>
</ul>
</li>
<li><a href="#orgheadline43">4.2. chord progression 5</a>
<ul>
<li><a href="#orgheadline36">4.2.1. define a sawtooth random chord player</a></li>
<li><a href="#orgheadline37">4.2.2. chord progression 6</a></li>
<li><a href="#orgheadline38">4.2.3. chord progression 7</a></li>
<li><a href="#orgheadline39">4.2.4. develop a looping function</a></li>
<li><a href="#orgheadline40">4.2.5. make a sawtooth chord player</a></li>
<li><a href="#orgheadline41">4.2.6. define a preselected set of chords for progression 9</a></li>
<li><a href="#orgheadline42">4.2.7. refactor chord progressions to use a player-fn</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline47">5. from the 'sequencing' wiki tutorial</a>
<ul>
<li><a href="#orgheadline45">5.1. use kick on each beat of a metronome</a></li>
<li><a href="#orgheadline46">5.2. startup a metronome and check in with its beats as it runs</a></li>
</ul>
</li>
<li><a href="#orgheadline50">6. develop chords progressions (not "intro" enough&#x2013;should be moved elsewhere?)</a>
<ul>
<li><a href="#orgheadline49">6.1. start working with post tonal set classes</a>
<ul>
<li><a href="#orgheadline48">6.1.1. getting-started babel session</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline52">7. miscellaneous utilities and problems</a>
<ul>
<li><a href="#orgheadline51">7.1. all caps is a problem&#x2013;clojure is case sensitive</a></li>
</ul>
</li>
<li><a href="#orgheadline54">8. play piano in overtone</a>
<ul>
<li><a href="#orgheadline53">8.1. </a></li>
</ul>
</li>
<li><a href="#orgheadline55">9. stop all playing sound</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-2">
<h2 id="orgheadline17"><span class="section-number-2">1</span> starting-up&#x2013;basics</h2>
<div class="outline-text-2" id="text-1">
<p>
When viewing this in emacs org-mode, you will see results for running
any block code; however, these results will not appear on the github
wiki (unless you click the 'Raw' tab at the top).
</p>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.1</span> namespaces</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A big part of really understanding how to build things in Clojure is
to understand namespaces. Learning about what namespaces are&#x2013;and
importantly, what's available to you "in" different namespaces&#x2013;is a
step that cannot be emphasized enough at the early stages of learning.
</p>
</div>
<div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> starting up from a .clj source file</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
The key here will be having an functioning cider-repl open and
evaluating a main source file. In emacs, this involves visiting the
<code>post_tonal_definitions.clj</code> file in my
post<sub>tonal</sub><sub>overtone</sub>/src/post<sub>tonal</sub><sub>overtone</sub> directory. (Note, the
leiningen build template involves installing a basic core.clj file.
Learning how to best use this is not obvious at first).
</p>

<p>
But, even more significantly, you will want to develop a strong
concept of how to instantiate a namespace, and how to load in any code
you want to be working with from WITHIN the namespace declaration.
</p>

<p>
Here's one good example (note, the presence of overtone.live on your
machine or in your files is no minor thing! There should be a link to 
how to best deal with this for those times when you are starting up a
system that hasn't had overtone working for it yet. The simplest
answer is to&#x2013;once this project is cloned&#x2013;navigate to the directory
containing it and start up your lein repl/cider-jack-in from there.
</p>

<p>
Note that the first time you do this, there may be a lot of stuff to
download! You can also simply just:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(use '<span style="color: #7CB8BB;">overtone.live</span>)
</pre>
</div>
<p>
)
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">ns</span> <span style="color: #7CB8BB;">post_tonal_overtone.core</span>
  (<span style="color: #BFEBBF;">:use</span> <span style="color: #7CB8BB;">overtone.live</span>)
  (<span style="color: #BFEBBF;">:require</span> [<span style="color: #7CB8BB;">post_tonal_overtone.data.set_class_data</span> <span style="color: #BFEBBF;">:as</span> set-class]))
</pre>
</div>
<p>
Here's a slightly more messed up one. Can you spot the differences,
subtle and obvious?
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">ns</span> <span style="color: #7CB8BB;">post-tonal-overtone.core</span>
  (<span style="color: #BFEBBF;">:use</span> <span style="color: #7CB8BB;">overtone.live</span>
        <span style="color: #7CB8BB;">overtone.inst.sampled-piano</span>

        <span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">post-tonal-overtone.set-class-data</span>
        <span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">post-tonal-overtone</span>
        <span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">org.clojure/math.combinatorics "0.1.1"</span>
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">is it necessary to load .repl?</span>
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">if you want to call 'dir' and such un-prefixed</span>
        <span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">clojure.repl</span>
        )
  (<span style="color: #BFEBBF;">:require</span> [<span style="color: #7CB8BB;">post_tonal_overtone.data.set_class_data</span> <span style="color: #BFEBBF;">:as</span> set-class]
            [<span style="color: #7CB8BB;">post_tonal_overtone.core</span> <span style="color: #BFEBBF;">:as</span> pt]))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">1.1.2</span> calling dir</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
If you want to get a sense of what you have been bringing in, and want
to begin to get a sense of how namespaces really work, take a look at
what may be defined in a given namespace.
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline2"></a>post<sub>tonal</sub><sub>overtone.core</sub><br  /><div class="outline-text-5" id="text-1-1-2-1">
<p>
Note, this will not necessarily produce the same results as below.
Why? What has to happen for all my nice handiwork to be loaded?
</p>
<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">post_tonal_overtone.core</span>)
</pre>
</div>
</div></li>
<li><a id="orgheadline3"></a><br  /><div class="outline-text-5" id="text-1-1-2-2">
<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">post_tonal_overtone.data.set_class_data</span>)
</pre>
</div>
</div></li>
<li><a id="orgheadline4"></a><br  /><div class="outline-text-5" id="text-1-1-2-3">
<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">post_tonal_overtone.probability_functions.finite-distributions</span>)
</pre>
</div>
</div></li>
<li><a id="orgheadline5"></a>overtone.live<br  /><div class="outline-text-5" id="text-1-1-2-4">
<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">overtone.live</span>)
</pre>
</div>
</div></li>
