src/post_tonal_overtone/org_files/first-steps.org
**** overtone.core--same as overtone.live?
#+BEGIN_SRC clojure :results output
(dir overtone.core)
#+END_SRC

#+RESULTS:
#+begin_example
*api-key*
*cache-root*
*constants*
*demo-time*
*node-tree-data*
*ugens*
->AudioBus
->Buffer
->BufferFile
->BufferInStream
->BufferInfo
->BufferOutStream
->ControlBus
->FreesoundSample
->Inst
->LossyWorker
->Metronome
->PlayableSample
->Sample
->ShellStringList
->Synth
->SynthGroup
->SynthNode
BITS
CHORD
COMPLEX
CONFIG-DEFAULTS
DEFAULT-PAN
DEFAULT-RATE
DEFAULT-VOLUME
DEGREE
ENV-SHAPES
EXP
EXPONENTIAL
FREE
FREE-AND-AFTER
FREE-AND-BEFORE
FREE-AND-GROUP-AFTER
FREE-AND-GROUP-AFTER-DEEP
FREE-AND-GROUP-BEFORE
FREE-AND-GROUP-BEFORE-DEEP
FREE-CHILDREN
FREE-FROM-THIS-ON
FREE-GROUP
FREE-PAUSE-AFTER
FREE-PAUSE-BEFORE
FREE-UPTO-THIS
HANN
IBus
IControllableNode
IMetronome
INF
INFINITE
ISynthGroup
ISynthNode
ISynthNodeStatus
LIN
LINEAR
MAGSUM
MAX-DELAY
MIDDLE-C
MIDI-NOTE-RE
MIDI-NOTE-RE-STR
MIDI-RANGE
MIXER-BOOT-DEPS
MKL
NO-ACTION
NODE-POSITION
NOTES
ONLY-MIDI-NOTE-RE
OVERTONE-ASSETS-FILE
OVERTONE-CONFIG-FILE
OVERTONE-DIRS
OVERTONE-LOG-FILE
OVERTONE-USER-STORE-FILE
OVERTONE-VERSION
OVERTONE-VERSION-STR
PAUSE
PHASE
POWER
RCOMPLEX
RECT
REVERSE-NOTES
SCALE
SINE
TWO-PI
WPHASE
__BUS-MIXERS__
__BUS-MONITOR-SYNTH__
__DEFINE-PLAYERS__
__ENSURE-DIRS___
__ENSURE-LIVE-ASSET-STORE__
__ENSURE-STORAGE-FILES__
__INTERN-UGENS__
__LOAD-CONFIG__
__MIXER-SYNTHS__
__MOVE-OLD-ROOT-DIR__
__PRINT-CONNECT-HELP__
__RECORDER__
__SERVER-INFO__
___reserve-overtone-busses____
_root-group_
a2k
a2k:kr
abs
absdif
acos
active-synth-nodes*
active-synths
#<cgen: add-cents>
#<cgen: add-cents:ar>
#<cgen: add-cents:kr>
add-instrument
adsr
after-delay
allpass-c
allpass-c:ar
allpass-c:kr
allpass-l
allpass-l:ar
allpass-l:kr
allpass-n
allpass-n:ar
allpass-n:kr
amclip
amp->db
amp-comp
amp-comp-a
amp-comp-a:ar
amp-comp-a:ir
amp-comp-a:kr
amp-comp:ar
amp-comp:ir
amp-comp:kr
ampdb
amplitude
amplitude-mod
amplitude-mod:ar
amplitude-mod:kr
amplitude:ar
amplitude:kr
analyse-events2
analyse-events2:ar
apf
apf:ar
apf:kr
apply-at
apply-by
asin
asr
asset-bundle-dir
asset-bundle-path
asset-path
asset-seq
assets*
at
atan
atan2
audio-bus
audio-bus-count*
audio-bus-monitor
audio-bus?
ay
ay:ar
b-all-pass
b-all-pass:ar
b-band-pass
b-band-pass:ar
b-band-stop
b-band-stop:ar
b-hi-pass
#<cgen: b-hi-pass4>
#<cgen: b-hi-pass4:ar>
b-hi-pass:ar
b-hi-shelf
b-hi-shelf:ar
b-low-pass
#<cgen: b-low-pass4>
#<cgen: b-low-pass4:ar>
b-low-pass:ar
b-low-shelf
b-low-shelf:ar
b-moog
b-moog:ar
b-peak-eq
b-peak-eq:ar
balance2
balance2:ar
ball
ball:ar
beat-ms
beat-track
beat-track2
beat-track2:kr
beat-track:kr
bi-pan-b2
bi-pan-b2:ar
bi-pan-b2:kr
bl-buf-rd
bl-buf-rd:ar
bl-buf-rd:kr
blip
blip:ar
block-node-until-ready?
boot-external-server
boot-internal-server
boot-server
boot-server-and-mixer
bpf
bpf:ar
bpf:kr
bpz2
bpz2:ar
bpz2:kr
breakcore
breakcore:ar
brf
brf:ar
brf:kr
brown-noise
brown-noise:ar
brown-noise:kr
brusselator
brusselator:ar
brz2
brz2:ar
brz2:kr
buf-allpass-c
buf-allpass-c:ar
buf-allpass-l
buf-allpass-l:ar
buf-allpass-n
buf-allpass-n:ar
buf-channels
buf-channels:ir
buf-channels:kr
buf-comb-c
buf-comb-c:ar
buf-comb-l
buf-comb-l:ar
buf-comb-n
buf-comb-n:ar
buf-delay-c
buf-delay-c:ar
buf-delay-c:kr
buf-delay-l
buf-delay-l:ar
buf-delay-l:kr
buf-delay-n
buf-delay-n:ar
buf-delay-n:kr
buf-dur
buf-dur:ir
buf-dur:kr
buf-frames
buf-frames:ir
buf-frames:kr
buf-rate-scale
buf-rate-scale:ir
buf-rate-scale:kr
buf-rd
buf-rd:ar
buf-rd:kr
buf-sample-rate
buf-sample-rate:ir
buf-sample-rate:kr
buf-samples
buf-samples:ir
buf-samples:kr
buf-wr
buf-wr:ar
buf-wr:kr
buffer
buffer-alloc-read
buffer-count*
buffer-cue
buffer-cue-pos
buffer-data
buffer-fill!
buffer-free
buffer-get
buffer-id
buffer-in-stream?
buffer-info
buffer-info?
buffer-live?
buffer-out-stream?
buffer-read
buffer-save
buffer-set!
buffer-size
buffer-stream
buffer-stream-close
buffer-write!
buffer-write-relay!
buffer?
bus-monitor
bus?
c-osc
c-osc:ar
c-osc:kr
cached-samples*
canonical-pitch-class-name
ceil
cents
cgen
check-bad-values
check-bad-values:ir
check-bad-values:kr
choose
choose-n
chord
chord-degree
chosen-from
clear
clear-all
clear-buf
clear-buf:ir
clear-fx
clear-instruments
clear-msg-queue
clip
clip-noise
clip-noise:ar
clip2
clip:ar
clip:kr
clipper32
clipper32:ar
clipper4
clipper4:ar
clipper8
clipper8:ar
closest-to
coin-gate
coin-gate:ir
coin-gate:kr
comb-c
comb-c:ar
comb-c:kr
comb-l
comb-l:ar
comb-l:kr
comb-n
comb-n:ar
comb-n:kr
compander
compander:ar
config
config-get
config-set!
connect-external-server
connection-info
control-bus
control-bus-get
control-bus-get-range
control-bus-monitor
control-bus-set!
control-bus-set-range!
control-bus?
control-dur
control-dur:ir
control-rate
control-rate:ir
convolution
convolution2
convolution2-l
convolution2-l:ar
convolution2:ar
convolution3
convolution3:ar
convolution3:kr
convolution:ar
cos
cosh
cosr
count-ugens
coyote
coyote:kr
cpsmidi
cpsoct
crackle
crackle:ar
crackle:kr
create-buffer-data
crossover-distortion
crossover-distortion:ar
ctl
cubed
cubed-shape
curve-shape
cusp-l
cusp-l:ar
cusp-n
cusp-n:ar
cutoff
cycle-fn
#<cgen: d-gauss>
#<cgen: d-gauss:dr>
dadsr
db->amp
dbamp
#<cgen: dbrown>
dbrown2
dbrown2:dr
#<cgen: dbrown:dr>
dbufrd
dbufrd:dr
#<cgen: dbufwr>
#<cgen: dbufwr:dr>
dc
dc:ar
dc:kr
decay
decay2
decay2:ar
decay2:kr
decay:ar
decay:kr
decimator
decimator:ar
decode-b2
decode-b2:ar
decode-b2:kr
defcgen
definst
defratio
defsample
defsynth
defunk-env
degree->int
degree->interval
degree-to-key
degree-to-key:ar
degree-to-key:kr
degrees->pitches
delay-c
delay-c:ar
delay-c:kr
delay-l
delay-l:ar
delay-l:kr
delay-n
delay-n:ar
delay-n:kr
delay1
delay1:ar
delay1:kr
delay2
delay2:ar
delay2:kr
demand
demand-env-gen
demand-env-gen:ar
demand-env-gen:kr
demand:ar
demand:kr
demo
detect-index
detect-index:ar
detect-index:kr
detect-silence
detect-silence:ar
detect-silence:kr
#<cgen: dgeom>
#<cgen: dgeom:dr>
#<cgen: dibrown>
#<cgen: dibrown:dr>
difsqr
disintegrator
disintegrator:ar
disk-in
disk-in:ar
disk-out
disk-out:ar
distort
#<cgen: diwhite>
#<cgen: diwhite:dr>
donce
donce:dr
done
done:kr
double-nested-allpass-c
double-nested-allpass-c:ar
double-nested-allpass-l
double-nested-allpass-l:ar
double-nested-allpass-n
double-nested-allpass-n:ar
double-well
double-well2
double-well2:ar
double-well3
double-well3:ar
double-well:ar
dpoll
dpoll:dr
drand
drand:dr
drive-noise
drive-noise:ar
dseq
dseq:dr
dser
dser:dr
#<cgen: dseries>
#<cgen: dseries:dr>
dshuf
dshuf:dr
dstutter
dstutter:dr
dswitch
dswitch1
dswitch1:dr
dswitch:dr
dust
dust2
dust2:ar
dust2:kr
dust:ar
dust:kr
#<cgen: duty>
#<cgen: duty:ar>
#<cgen: duty:kr>
#<cgen: dwhite>
#<cgen: dwhite:dr>
dxrand
dxrand:dr
ensure-buffer-active!
ensure-connected!
ensure-node-active!
env-adsr
env-asr
env-cutoff
env-dadsr
env-gen
env-gen:ar
env-gen:kr
env-lin
env-perc
env-sine
env-triangle
envelope
event
event-debug-off
event-debug-on
event-monitor
event-monitor-keys
event-monitor-off
event-monitor-on
event-monitor-timer
example
examples
excess
exp
exp-rand
exp-rand:ir
expand-control-ugs
exponential-shape
external-server-log
external-server?
f-sin-osc
f-sin-osc:ar
f-sin-osc:kr
fb-sine-c
fb-sine-c:ar
fb-sine-l
fb-sine-l:ar
fb-sine-n
fb-sine-n:ar
fft
fft-trigger
fft-trigger:kr
fft:kr
fhn-trig
fhn-trig:ar
fhn-trig:kr
fhn2-dc
fhn2-dc:ar
fhn2-dc:kr
fhn2-dl
fhn2-dl:ar
fhn2-dl:kr
fhn2-dn
fhn2-dn:ar
fhn2-dn:kr
fifth
file-buffer?
fill
find-chord
find-note-name
find-pitch-class-name
find-scale-name
find-ugen
find-ugen-doc
flat
floor
fold
fold2
fold:ar
fold:kr
formant
formant:ar
formlet
formlet:ar
formlet:kr
fos
fos:ar
fos:kr
foundation-default-group
foundation-input-group
foundation-monitor-group
foundation-output-group
foundation-overtone-group
foundation-root-group
foundation-safe-group
foundation-safe-post-default-group
foundation-safe-pre-default-group
foundation-user-group
fourth
frac
frame-compare
frame-compare:kr
free
free-all-loaded-samples
free-bus
free-sample
free-self
free-self-when-done
free-self-when-done:kr
free-self:kr
free-verb
free-verb2
free-verb2:ar
free-verb:ar
free:kr
freesound
freesound-info
freesound-pack-dir
freesound-pack-info
freesound-path
freesound-sample
freesound-search
freesound-search-paths
freesound-searchm
freq-shift
freq-shift:ar
#<synth: fx-bitcrusher>
#<synth: fx-chorus>
#<synth: fx-compressor>
#<synth: fx-distortion>
#<synth: fx-distortion-tubescreamer>
#<synth: fx-distortion2>
#<synth: fx-echo>
#<synth: fx-feedback>
#<synth: fx-feedback-distortion>
#<synth: fx-freeverb>
#<synth: fx-limiter>
#<synth: fx-noise-gate>
#<synth: fx-reverb>
#<synth: fx-rhpf>
#<synth: fx-rlpf>
#<synth: fx-sustainer>
g-verb
g-verb:ar
gate
gate:ar
gate:kr
gather-ugens-and-constants
gauss-trig
gauss-trig:ar
gauss-trig:kr
gbman-l
gbman-l:ar
gbman-n
gbman-n:ar
gbman-trig
gbman-trig:ar
gbman-trig:kr
gbman2-dc
gbman2-dc:ar
gbman2-dc:kr
gbman2-dl
gbman2-dl:ar
gbman2-dl:kr
gbman2-dn
gbman2-dn:ar
gbman2-dn:kr
gendy1
gendy1:ar
gendy1:kr
gendy2
gendy2:ar
gendy2:kr
gendy3
gendy3:ar
gendy3:kr
gendy4
gendy4:ar
gendy4:kr
gendy5
gendy5:ar
gendy5:kr
generate-full-cgen-doc
get-example
glitch-hpf
glitch-hpf:ar
glitch-hpf:kr
glitch-rhpf
glitch-rhpf:ar
glitch-rhpf:kr
grain-in
grain-in:ar
grain-sin
grain-sin:ar
graphviz
gravity-grid
gravity-grid2
gravity-grid2:ar
gravity-grid:ar
gray-noise
gray-noise:ar
grep
group
group-append-node
group-clear
group-deep-clear
group-free
group-node-tree
group-post-tree
group-prepend-node
han-window
hasher
hasher:ar
henon-c
henon-c:ar
henon-l
henon-l:ar
henon-n
henon-n:ar
henon-trig
henon-trig:ar
henon-trig:kr
henon2-dc
henon2-dc:ar
henon2-dc:kr
henon2-dl
henon2-dl:ar
henon2-dl:kr
henon2-dn
henon2-dn:ar
henon2-dn:kr
hilbert
hilbert:ar
#<cgen: hold>
#<cgen: hold:ar>
hpf
hpf:ar
hpf:kr
hpz1
hpz1:ar
hpz1:kr
hpz2
hpz2:ar
hpz2:kr
hypot
hypot-aprox
hz->midi
i-env-gen
i-env-gen:ar
i-env-gen:kr
i-rand
i-rand:ir
idify
ifft
ifft:ar
ifft:kr
iir-filter
iir-filter:ar
impulse
impulse:ar
impulse:kr
in
#<synth: in-bus-mixer>
in-feedback
in-feedback:ar
in-osc-bundle
in-range
in-range:ar
in-range:kr
in-rect
in-rect:ar
in-rect:kr
in-trig
in-trig:kr
in-unested-osc-bundle
in:ar
in:kr
inactive-buffer-modification-error
inactive-node-modification-error
index
index-in-between
index-in-between:ar
index-in-between:kr
index:ar
index:kr
input-bus-count*
input-gain
inst
inst-channels
inst-fx!
inst-mixer
inst-pan!
inst-volume!
inst?
integrator
integrator:ar
integrator:kr
internal-server?
internal:d-gauss
internal:d-gauss:dr
internal:dbrown
internal:dbrown:dr
internal:dbufwr
internal:dbufwr:dr
internal:dgeom
internal:dgeom:dr
internal:dibrown
internal:dibrown:dr
internal:diwhite
internal:diwhite:dr
internal:dseries
internal:dseries:dr
internal:duty
internal:duty:ar
internal:duty:kr
internal:dwhite
internal:dwhite:dr
internal:local-buf
internal:local-buf:ir
internal:poll
internal:poll:ar
internal:poll:kr
internal:t-duty
internal:t-duty:ar
internal:t-duty:kr
interspaced
interval-freq
invert
invert-chord
k2a
k2a:ar
key-state
key-state:kr
key-track
key-track:kr
kill
kill-player
kill-server
klang
klang:ar
klank
klank:ar
lag
lag-in
lag-in:kr
lag-ud
lag-ud:ar
lag-ud:kr
lag2
lag2-ud
lag2-ud:ar
lag2-ud:kr
lag2:ar
lag2:kr
lag3
lag3-ud
lag3-ud:ar
lag3-ud:kr
lag3:ar
lag3:kr
lag:ar
lag:kr
last-value
last-value:ar
last-value:kr
latch
latch:ar
latch:kr
latoocarfian-c
latoocarfian-c:ar
latoocarfian-l
latoocarfian-l:ar
latoocarfian-n
latoocarfian-n:ar
latoocarfian-trig
latoocarfian-trig:ar
latoocarfian-trig:kr
latoocarfian2-dc
latoocarfian2-dc:ar
latoocarfian2-dc:kr
latoocarfian2-dl
latoocarfian2-dl:ar
latoocarfian2-dl:kr
latoocarfian2-dn
latoocarfian2-dn:ar
latoocarfian2-dn:kr
leak-dc
leak-dc:ar
leak-dc:kr
least-change
least-change:ar
least-change:kr
lf-brown-noise0
lf-brown-noise0:ar
lf-brown-noise0:kr
lf-brown-noise1
lf-brown-noise1:ar
lf-brown-noise1:kr
lf-brown-noise2
lf-brown-noise2:ar
lf-brown-noise2:kr
lf-clip-noise
lf-clip-noise:ar
lf-clip-noise:kr
lf-cub
lf-cub:ar
lf-cub:kr
lf-gauss
lf-gauss:ar
lf-gauss:kr
lf-noise0
lf-noise0:ar
lf-noise0:kr
lf-noise1
lf-noise1:ar
lf-noise1:kr
lf-noise2
lf-noise2:ar
lf-noise2:kr
lf-par
lf-par:ar
lf-par:kr
lf-pulse
lf-pulse:ar
lf-pulse:kr
lf-saw
lf-saw:ar
lf-saw:kr
lf-tri
lf-tri:ar
lf-tri:kr
lfd-clip-noise
lfd-clip-noise:ar
lfd-clip-noise:kr
lfd-noise0
lfd-noise0:ar
lfd-noise0:kr
lfd-noise1
lfd-noise1:ar
lfd-noise1:kr
lfd-noise3
lfd-noise3:ar
lfd-noise3:kr
limiter
limiter:ar
lin
lin-cong-c
lin-cong-c:ar
lin-cong-l
lin-cong-l:ar
lin-cong-n
lin-cong-n:ar
lin-exp
lin-exp:ar
lin-exp:kr
#<cgen: lin-lin>
#<cgen: lin-lin:ar>
#<cgen: lin-lin:kr>
lin-pan2
lin-pan2:ar
lin-pan2:kr
lin-rand
lin-rand:ir
lin-x-fade2
lin-x-fade2:ar
lin-x-fade2:kr
line
line:ar
line:kr
linear-interpolate-wavetable
linear-shape
linen
linen:kr
live-config
live-store
load-instruments
load-sample
load-samples
loaded-samples*
#<cgen: local-buf>
#<cgen: local-buf:ir>
local-in
local-in:ar
local-in:kr
local-out
local-out:ar
local-out:kr
log
log10
log2
logistic
logistic:ar
lorenz-l
lorenz-l:ar
lorenz-trig
lorenz-trig:ar
lorenz-trig:kr
lorenz2-dc
lorenz2-dc:ar
lorenz2-dc:kr
lorenz2-dl
lorenz2-dl:ar
lorenz2-dl:kr
lorenz2-dn
lorenz2-dn:ar
lorenz2-dn:kr
loudness
loudness:kr
lpf
lpf1
lpf18
lpf18:ar
lpf1:ar
lpf1:kr
lpf:ar
lpf:kr
lpfvs6
lpfvs6:ar
lpfvs6:kr
lpz1
lpz1:ar
lpz1:kr
lpz2
lpz2:ar
lpz2:kr
ls
mantissa-mask
mantissa-mask:ar
map->AudioBus
map->Buffer
map->BufferFile
map->BufferInStream
map->BufferInfo
map->BufferOutStream
map->ControlBus
map->FreesoundSample
map->Inst
map->LossyWorker
map->PlayableSample
map->Sample
map->Synth
map->SynthGroup
map->SynthNode
markov-synth
markov-synth:ar
#<synth: master-recorder>
match-note
max-local-bufs
max-local-bufs:ir
mda-piano
mda-piano:ar
median
median:ar
median:kr
membrane-circle
membrane-circle:ar
membrane-hexagon
membrane-hexagon:ar
metro-bar
metro-bar-start
metro-beat
metro-bpb
metro-bpm
metro-start
metro-tick
metro-tock
metronome
mfcc
mfcc:kr
mid-eq
mid-eq:ar
mid-eq:kr
midi->hz
midi-agent-for-control
midi-capture-next-control-input
midi-capture-next-controller-control-key
midi-capture-next-controller-key
midi-connected-devices
midi-connected-receivers
midi-control
midi-control-agents*
midi-device-keys
midi-device-num
midi-find-connected-device
midi-find-connected-devices
midi-find-connected-receiver
midi-find-connected-receivers
midi-full-device-key
midi-inst-controller
midi-mk-control-key-keyword
midi-mk-full-control-event-key
midi-mk-full-device-event-key
midi-mk-full-device-key
midi-note
midi-note-off
midi-note-on
midi-player-stop
midi-poly-player
midi-sysex
midicps
midiratio
min-sixth
min-third
#<cgen: mix>
#<cgen: mix:ar>
mixer-booted?
mk-cgen
mk-midi-string
modify-synth-params
#<synth: mono-audio-bus-level>
#<synth: mono-inst-mixer>
#<synth: mono-player>
#<synth: mono-stream-player>
moog-ff
moog-ff:ar
moog-ff:kr
moog-ladder
moog-ladder:ar
moog-ladder:kr
most-change
most-change:ar
most-change:kr
mouse-button
mouse-button:kr
mouse-x
mouse-x:kr
mouse-y
mouse-y:kr
mul-add
mul-add:ar
mul-add:dr
mul-add:ir
mul-add:kr
n-rand
n-rand:ir
needle-rect
needle-rect:ar
neg
nested-allpass-c
nested-allpass-c:ar
nested-allpass-l
nested-allpass-l:ar
nested-allpass-n
nested-allpass-n:ar
nl-filt-c
nl-filt-c:ar
nl-filt-c:kr
nl-filt-l
nl-filt-l:ar
nl-filt-l:kr
nl-filt-n
nl-filt-n:ar
nl-filt-n:kr
node
node-active?
node-block-until-ready
node-block-until-ready*
node-control
node-control*
node-control-range
node-control-range*
node-created-event-key
node-destroyed-event-key
node-free
node-free*
node-get-control
node-get-control-range
node-get-controls
node-live?
node-loading?
node-map-controls
node-map-controls*
node-map-n-controls
node-map-n-controls*
node-pause
node-pause*
node-paused-event-key
node-paused?
node-place
node-place*
node-start
node-start*
node-started-event-key
node-status
node-status*
node-tree
node-tree-matching-synth-ids
node-tree-seq
node-tree-zipper
node?
normalize-synth-args
normalizer
normalizer:ar
not-pos?
note
note-info
now
ns-instruments
nth-equal-tempered-freq
nth-interval
nth-octave
num-audio-buses
num-audio-buses:ir
num-buffers
num-buffers:ir
num-control-buses
num-control-buses:ir
num-frames
num-input-buses
num-input-buses:ir
num-output-buses
num-output-buses:ir
num-running-synths
num-running-synths:ir
num-running-synths:kr
octave
octave-note
octcps
odoc
offset-out
offset-out:ar
on-event
on-latest-event
on-latest-trigger
on-node-created
on-node-destroyed
on-node-paused
on-node-started
on-sync-event
on-sync-trigger
on-trigger
one-pole
one-pole:ar
one-pole:kr
one-zero
one-zero:ar
one-zero:kr
oneshot-event
oneshot-sync-event
only
onsets
onsets:kr
opp
os-fold4
os-fold4:ar
os-fold8
os-fold8:ar
os-trunc4
os-trunc4:ar
os-trunc8
os-trunc8:ar
os-wrap4
os-wrap4:ar
os-wrap8
os-wrap8:ar
osc
osc-bundle
osc-client
osc-close
osc-debug
osc-handle
osc-handlers
osc-listen
osc-listeners
osc-msg
osc-n
osc-n:ar
osc-n:kr
osc-now
osc-peer
osc-recv
osc-reply
osc-reply-msg
osc-rm-all-handlers
osc-rm-all-listeners
osc-rm-handler
osc-rm-listener
osc-send
osc-send-bundle
osc-send-msg
osc-server
osc-target
osc:ar
osc:kr
oscy
oscy:ar
oscy:kr
out
#<synth: out-bus-mixer>
out:ar
out:kr
output-bus-count*
p-sin-grain
p-sin-grain:ar
pan-az
pan-az:ar
pan-az:kr
pan-b
pan-b2
pan-b2:ar
pan-b2:kr
pan-b:ar
pan-b:kr
pan2
pan2:ar
pan2:kr
pan4
pan4:ar
pan4:kr
parse-cgen-params
part-conv
part-conv:ar
pause
pause-self
pause-self-when-done
pause-self-when-done:kr
pause-self:kr
pause:kr
peak
peak-eq2
peak-eq2:ar
peak-eq4
peak-eq4:ar
peak-follower
peak-follower:ar
peak-follower:kr
peak:ar
peak:kr
perc
periodic
phasor
phasor:ar
phasor:kr
pink-noise
pink-noise:ar
pink-noise:kr
pitch
pitch-shift
pitch-shift:ar
pitch:kr
play-buf
play-buf:ar
play-buf:kr
player-pool
pluck
pluck:ar
#<cgen: pm-osc>
#<cgen: pm-osc:ar>
#<cgen: pm-osc:kr>
#<cgen: poll>
#<cgen: poll:ar>
#<cgen: poll:kr>
poly-players*
pow
pp-node-tree
pp-sdef
pp-unified-sdef
pre-inst
pre-synth
pretty-ugen-doc-string
print-ugen-docs
pulse
pulse-count
pulse-count:ar
pulse-count:kr
pulse-divider
pulse-divider:ar
pulse-divider:kr
pulse:ar
pv-add
pv-add:kr
pv-bin-scramble
pv-bin-scramble:kr
pv-bin-shift
pv-bin-shift:kr
pv-bin-wipe
pv-bin-wipe:kr
pv-brick-wall
pv-brick-wall:kr
pv-common-mag
pv-common-mag:kr
pv-common-mul
pv-common-mul:kr
pv-compander
pv-compander:kr
pv-conformal-map
pv-conformal-map:kr
pv-conj
pv-conj:kr
pv-copy
pv-copy-phase
pv-copy-phase:kr
pv-copy:kr
pv-cutoff
pv-cutoff:kr
pv-diffuser
pv-diffuser:kr
pv-div
pv-div:kr
pv-hainsworth-foote
pv-hainsworth-foote:ar
pv-jensen-andersen
pv-jensen-andersen:ar
pv-local-max
pv-local-max:kr
pv-mag-above
pv-mag-above:kr
pv-mag-below
pv-mag-below:kr
pv-mag-clip
pv-mag-clip:kr
pv-mag-div
pv-mag-div:kr
pv-mag-freeze
pv-mag-freeze:kr
pv-mag-gate
pv-mag-gate:kr
pv-mag-minus
pv-mag-minus:kr
pv-mag-mul
pv-mag-mul:kr
pv-mag-noise
pv-mag-noise:kr
pv-mag-scale
pv-mag-scale:kr
pv-mag-shift
pv-mag-shift:kr
pv-mag-smear
pv-mag-smear:kr
pv-mag-squared
pv-mag-squared:kr
pv-max
pv-max:kr
pv-min
pv-min:kr
pv-morph
pv-morph:kr
pv-mul
pv-mul:kr
pv-phase-shift
pv-phase-shift270
pv-phase-shift270:kr
pv-phase-shift90
pv-phase-shift90:kr
pv-phase-shift:kr
pv-rand-comb
pv-rand-comb:kr
pv-rand-wipe
pv-rand-wipe:kr
pv-rect-comb
pv-rect-comb2
pv-rect-comb2:kr
pv-rect-comb:kr
pv-soft-wipe
pv-soft-wipe:kr
pv-x-fade
pv-x-fade:kr
quad-c
quad-c:ar
quad-l
quad-l:ar
quad-n
quad-n:ar
radians-per-sample
radians-per-sample:ir
ramp
ramp:ar
ramp:kr
rand-chord
rand-id
rand-id:ir
rand-id:kr
rand-seed
rand-seed:ir
rand-seed:kr
#<cgen: range-lin>
#<cgen: range-lin:ar>
#<cgen: range-lin:kr>
ranged-rand
ratiomidi
reciprocal
record-buf
record-buf:ar
record-buf:kr
recording-start
recording-stop
recording?
rect-window
recv
register-assets!
registered-assets
remove-event-handler
remove-instrument
replace-out
replace-out:ar
replace-out:kr
reset-instruments
reset-synth-defaults
resolve-chord
resolve-degree
resolve-degrees
resolve-scale
resonz
resonz:ar
resonz:kr
rhpf
rhpf:ar
rhpf:kr
ring1
ring2
ring3
ring4
ringz
ringz:ar
ringz:kr
rlpf
rlpf:ar
rlpf:kr
rlpfd
rlpfd:ar
rlpfd:kr
rotate
rotate2
rotate2:ar
rotate2:kr
round
round-down
round-to
round-up
run
running-max
running-max:ar
running-max:kr
running-min
running-min:ar
running-min:kr
running-sum
running-sum:ar
running-sum:kr
sample
sample-dur
sample-dur:ir
sample-info
sample-player
sample-rate
sample-rate*
sample-rate:ir
sample?
saw
saw:ar
sc-debug-off
sc-debug-on
sc-osc-debug-off
sc-osc-debug-on
scale
scale-field
scale-neg
scale-range
#<cgen: scaled-play-buf>
#<cgen: scaled-play-buf:ar>
#<cgen: scaled-play-buf:kr>
#<cgen: scaled-v-disk-in>
#<cgen: scaled-v-disk-in:ar>
schmidt
schmidt:ar
schmidt:kr
scope-out
scope-out:ar
sdef
select
select:ar
select:kr
send-reply
send-reply:ar
send-reply:kr
send-trig
send-trig:ar
send-trig:kr
server-connected?
server-connecting?
server-disconnected?
server-info
server-num-audio-buses
server-num-buffers
server-num-input-buses
server-num-output-buses
server-opts
server-sample-rate
server-status
set-buf
set-buf:ar
set-buf:kr
set-reset-ff
set-reset-ff:ar
set-reset-ff:kr
shaper
shaper:ar
shaper:kr
shared-in
shared-in:kr
shared-out
shared-out:kr
sharp
shift
show-graphviz-synth
show-schedule
sign
signal->wavetable
silent
silent:ar
sin
sin-osc
sin-osc-fb
sin-osc-fb:ar
sin-osc-fb:kr
sin-osc:ar
sin-osc:kr
sine
sine-shape
sine-shaper
sine-shaper:ar
sinh
sinr
sixth
skip-needle
skip-needle:ar
slew
slew:ar
slew:kr
slope
slope:ar
slope:kr
smooth-decimator
smooth-decimator:ar
snd
snd-immediately
#<synth: snd-server-info>
#<cgen: soft-clip-amp>
soft-clip-amp4
soft-clip-amp4:ar
soft-clip-amp8
soft-clip-amp8:ar
#<cgen: soft-clip-amp:ar>
soft-clipper4
soft-clipper4:ar
soft-clipper8
soft-clipper8:ar
softclip
sos
sos:ar
sos:kr
#<cgen: sound-in>
#<cgen: sound-in:ar>
spec-centroid
spec-centroid:kr
spec-flatness
spec-flatness:kr
spec-pcile
spec-pcile:kr
speech-buffer
#<cgen: splay>
#<cgen: splay:ar>
spring
spring:ar
sqrdif
sqrsum
sqrt
#<cgen: square>
#<cgen: square:ar>
squared
squared-shape
standard-l
standard-l:ar
standard-n
standard-n:ar
standard-trig
standard-trig:ar
standard-trig:kr
standard2-dc
standard2-dc:ar
standard2-dc:kr
standard2-dl
standard2-dl:ar
standard2-dl:kr
standard2-dn
standard2-dn:ar
standard2-dn:kr
status
step-shape
stepper
stepper:ar
stepper:kr
stereo-convolution2-l
stereo-convolution2-l:ar
#<synth: stereo-inst-mixer>
#<synth: stereo-player>
#<synth: stereo-stream-player>
stk-banded-wg
stk-banded-wg:ar
stk-banded-wg:kr
stk-bee-three
stk-bee-three:ar
stk-bee-three:kr
stk-blow-hole
stk-blow-hole:ar
stk-blow-hole:kr
stk-bowed
stk-bowed:ar
stk-bowed:kr
stk-clarinet
stk-clarinet:ar
stk-clarinet:kr
stk-flute
stk-flute:ar
stk-flute:kr
stk-mandolin
stk-mandolin:ar
stk-mandolin:kr
stk-modal-bar
stk-modal-bar:ar
stk-modal-bar:kr
stk-moog
stk-moog:ar
stk-moog:kr
stk-pluck
stk-pluck:ar
stk-pluck:kr
stk-saxofony
stk-saxofony:ar
stk-saxofony:kr
stk-shakers
stk-shakers:ar
stk-shakers:kr
stk-voic-form
stk-voic-form:ar
stk-voic-form:kr
stop
stop-all
stop-player
store
store-get
store-set!
streson
streson:ar
streson:kr
studio*
subsample-offset
subsample-offset:ir
#<cgen: sum>
#<cgen: sum:ar>
sumsqr
svf
svf:ar
svf:kr
sweep
sweep:ar
sweep:kr
sync-event
sync-saw
sync-saw:ar
sync-saw:kr
synth
synth-arg-index
synth-args
synth-form
synth-player
synth?
synthdef
t-ball
t-ball:ar
t-beta-rand
t-beta-rand:ar
t-beta-rand:kr
t-brown-rand
t-brown-rand:ar
t-brown-rand:kr
t-delay
t-delay:ar
t-delay:kr
#<cgen: t-duty>
#<cgen: t-duty:ar>
#<cgen: t-duty:kr>
t-exp-rand
t-exp-rand:ar
t-exp-rand:kr
t-gauss-rand
t-gauss-rand:ar
t-gauss-rand:kr
t-grains
t-grains2
t-grains2:ar
t-grains3
t-grains3:ar
t-grains:ar
t-rand
t-rand:ar
t-rand:kr
t-windex
t-windex:ar
t-windex:kr
t2a
t2a:ar
t2k
t2k:kr
tan
tanh
tanr
#<cgen: tap>
#<cgen: tap:kr>
third
thresh
ti-rand
ti-rand:ar
ti-rand:kr
timer
timer:ar
timer:kr
to-id
to-sc-id
to-sc-id*
toggle-ff
toggle-ff:ar
toggle-ff:kr
topological-sort-ugens
trapezoid
trapezoid:ar
trapezoid:kr
tri-window
triangle
trig
trig-avg
trig-avg:kr
trig-id
trig1
trig1:ar
trig1:kr
trig:ar
trig:kr
two-pole
two-pole:ar
two-pole:kr
two-zero
two-zero:ar
two-zero:kr
ugen-doc
unified-sdef
unison
unregister-assets!
update-tap-data
v-disk-in
v-disk-in:ar
v-osc
v-osc3
v-osc3:ar
v-osc3:kr
v-osc:ar
v-osc:kr
validate-tap!
var-saw
var-saw:ar
var-saw:kr
vibrato
vibrato:ar
vibrato:kr
volume
vosim
vosim:ar
w-amp
w-amp:kr
wait-until-mixer-booted
warp1
warp1:ar
wavetable
wavetable->signal
weighted-choose
weighted-coin
wel-window
welch-shape
white-noise
white-noise:ar
white-noise:kr
with-inactive-buffer-modification-error
with-inactive-modification-error
with-inactive-node-modification-error
with-no-ugen-checks
with-overloaded-ugens
with-ugen-debugging
without-node-blocking
without-osc-bundle
wrap
wrap-index
wrap-index:ar
wrap-index:kr
wrap2
wrap:ar
wrap:kr
write-wav
x-fade2
x-fade2:ar
x-fade2:kr
x-line
x-line:ar
x-line:kr
x-out
x-out:ar
x-out:kr
xor
zero-conf-off
zero-conf-on
zero-conf?
zero-crossing
zero-crossing:ar
zero-crossing:kr
#+end_example

