src/post_tonal_overtone/org_files/html-versions/first-steps.html
<li><a id="orgheadline6"></a>overtone.core&#x2013;same as overtone.live?<br  /><div class="outline-text-5" id="text-1-1-2-5">
<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">overtone.core</span>)
</pre>
</div>
</div></li>
