src/post_tonal_overtone/org_files/first-steps.org
**** clojure.core
#+BEGIN_SRC clojure :results output
(dir clojure.core)
#+END_SRC

#+RESULTS:
#+begin_example
*
*'
*1
*2
*3
*agent*
*allow-unresolved-vars*
*assert*
*clojure-version*
*command-line-args*
*compile-files*
*compile-path*
*compiler-options*
*data-readers*
*default-data-reader-fn*
*e
*err*
*file*
*flush-on-newline*
*fn-loader*
*in*
*math-context*
*ns*
*out*
*print-dup*
*print-length*
*print-level*
*print-meta*
*print-readably*
*read-eval*
*source-path*
*unchecked-math*
*use-context-classloader*
*verbose-defrecords*
*warn-on-reflection*
+
+'
-
-'
->
->>
->ArrayChunk
->Vec
->VecNode
->VecSeq
-cache-protocol-fn
-reset-methods
..
/
<
<=
=
==
>
>=
EMPTY-NODE
accessor
aclone
add-classpath
add-watch
agent
agent-error
agent-errors
aget
alength
alias
all-ns
alter
alter-meta!
alter-var-root
amap
ancestors
and
apply
areduce
array-map
as->
aset
aset-boolean
aset-byte
aset-char
aset-double
aset-float
aset-int
aset-long
aset-short
assert
assoc
assoc!
assoc-in
associative?
atom
await
await-for
await1
bases
bean
bigdec
bigint
biginteger
binding
bit-and
bit-and-not
bit-clear
bit-flip
bit-not
bit-or
bit-set
bit-shift-left
bit-shift-right
bit-test
bit-xor
boolean
boolean-array
booleans
bound-fn
bound-fn*
bound?
butlast
byte
byte-array
bytes
case
cast
char
char-array
char-escape-string
char-name-string
char?
chars
chunk
chunk-append
chunk-buffer
chunk-cons
chunk-first
chunk-next
chunk-rest
chunked-seq?
class
class?
clear-agent-errors
clojure-version
coll?
comment
commute
comp
comparator
compare
compare-and-set!
compile
complement
concat
cond
cond->
cond->>
condp
conj
conj!
cons
constantly
construct-proxy
contains?
count
counted?
create-ns
create-struct
cycle
dec
dec'
decimal?
declare
default-data-readers
definline
definterface
defmacro
defmethod
defmulti
defn
defn-
defonce
defprotocol
defrecord
defstruct
deftype
delay
delay?
deliver
denominator
deref
derive
descendants
destructure
disj
disj!
dissoc
dissoc!
distinct
distinct?
doall
dorun
doseq
dosync
dotimes
doto
double
double-array
doubles
drop
drop-last
drop-while
empty
empty?
ensure
enumeration-seq
error-handler
error-mode
eval
even?
every-pred
every?
ex-data
ex-info
extend
extend-protocol
extend-type
extenders
extends?
false?
ffirst
file-seq
filter
filterv
find
find-keyword
find-ns
find-protocol-impl
find-protocol-method
find-var
first
flatten
float
float-array
float?
floats
flush
fn
fn?
fnext
fnil
for
force
format
frequencies
future
future-call
future-cancel
future-cancelled?
future-done?
future?
gen-class
gen-interface
gensym
get
get-in
get-method
get-proxy-class
get-thread-bindings
get-validator
group-by
hash
hash-combine
hash-map
hash-ordered-coll
hash-set
hash-unordered-coll
identical?
identity
if-let
if-not
if-some
ifn?
import
in-ns
inc
inc'
init-proxy
instance?
int
int-array
integer?
interleave
intern
interpose
into
into-array
ints
io!
isa?
iterate
iterator-seq
juxt
keep
keep-indexed
key
keys
keyword
keyword?
last
lazy-cat
lazy-seq
let
letfn
line-seq
list
list*
list?
load
load-file
load-reader
load-string
loaded-libs
locking
long
long-array
longs
loop
macroexpand
macroexpand-1
make-array
make-hierarchy
map
map-indexed
map?
mapcat
mapv
max
max-key
memfn
memoize
merge
merge-with
meta
method-sig
methods
min
min-key
mix-collection-hash
mod
munge
name
namespace
namespace-munge
neg?
newline
next
nfirst
nil?
nnext
not
not-any?
not-empty
not-every?
not=
ns
ns-aliases
ns-imports
ns-interns
ns-map
ns-name
ns-publics
ns-refers
ns-resolve
ns-unalias
ns-unmap
nth
nthnext
nthrest
num
number?
numerator
object-array
odd?
or
parents
partial
partition
partition-all
partition-by
pcalls
peek
persistent!
pmap
pop
pop!
pop-thread-bindings
pos?
pr
pr-str
prefer-method
prefers
primitives-classnames
print
print-ctor
print-dup
print-method
print-simple
print-str
printf
println
println-str
prn
prn-str
promise
proxy
proxy-call-with-super
proxy-mappings
proxy-name
proxy-super
push-thread-bindings
pvalues
quot
rand
rand-int
rand-nth
range
ratio?
rational?
rationalize
re-find
re-groups
re-matcher
re-matches
re-pattern
re-seq
read
read-line
read-string
realized?
record?
reduce
reduce-kv
reduced
reduced?
reductions
ref
ref-history-count
ref-max-history
ref-min-history
ref-set
refer
refer-clojure
reify
release-pending-sends
rem
remove
remove-all-methods
remove-method
remove-ns
remove-watch
repeat
repeatedly
replace
replicate
require
reset!
reset-meta!
resolve
rest
restart-agent
resultset-seq
reverse
reversible?
rseq
rsubseq
satisfies?
second
select-keys
send
send-off
send-via
seq
seq?
seque
sequence
sequential?
set
set-agent-send-executor!
set-agent-send-off-executor!
set-error-handler!
set-error-mode!
set-validator!
set?
short
short-array
shorts
shuffle
shutdown-agents
slurp
some
some->
some->>
some-fn
some?
sort
sort-by
sorted-map
sorted-map-by
sorted-set
sorted-set-by
sorted?
special-symbol?
spit
split-at
split-with
str
string?
struct
struct-map
subs
subseq
subvec
supers
swap!
symbol
symbol?
sync
take
take-last
take-nth
take-while
test
the-ns
thread-bound?
time
to-array
to-array-2d
trampoline
transient
tree-seq
true?
type
unchecked-add
unchecked-add-int
unchecked-byte
unchecked-char
unchecked-dec
unchecked-dec-int
unchecked-divide-int
unchecked-double
unchecked-float
unchecked-inc
unchecked-inc-int
unchecked-int
unchecked-long
unchecked-multiply
unchecked-multiply-int
unchecked-negate
unchecked-negate-int
unchecked-remainder-int
unchecked-short
unchecked-subtract
unchecked-subtract-int
underive
unquote
unquote-splicing
unsigned-bit-shift-right
update-in
update-proxy
use
val
vals
var-get
var-set
var?
vary-meta
vec
vector
vector-of
vector?
when
when-first
when-let
when-not
when-some
while
with-bindings
with-bindings*
with-in-str
with-loading-context
with-local-vars
with-meta
with-open
with-out-str
with-precision
with-redefs
with-redefs-fn
xml-seq
zero?
zipmap
#+end_example
*** simple namespaces moves
For the moment, let's see what evaluating the following reveals.

 #+BEGIN_SRC clojure :session getting-started :tangle yes
(in-ns 'user)
 #+END_SRC

 #+RESULTS:
 : #<Namespace user>

 #+BEGIN_SRC clojure :session getting-started :tangle yes 
*ns*
 #+END_SRC

 #+RESULTS:

 You'll discover that it is good practice to define a namespace at the
 beginning of a file of related code. If you are working through this
 in emacs org-mode babel, evaluate this now (The results of executing
 src_elisp{C-c C-c} on or within block will be telling).

 #+BEGIN_SRC clojure :session getting-started :tangle yes
(in-ns 'post_tonal_overtone.core)
 #+END_SRC

 #+RESULTS:
 : #<Namespace post_tonal_overtone.core>

You can either call this in the CIDER repl, or from within a org-babel
block.

Now, you should check to see what went down (especially in a babel
block where it might not be obvious). If you have called code in the
REPL but not within a Babel block you may not always be in the right
place (note a discrepancy here).

 #+RESULTS:
 : #<Namespace post_tonal_overtone.core>

 #+BEGIN_SRC clojure :session getting-started
*ns*
 #+END_SRC

 #+RESULTS:

#+BEGIN_SRC clojure :results output
(dir post_tonal_overtone.core)
#+END_SRC

#+RESULTS:




#+begin_example
chord-progression-time1
chord-progression-time10
chord-progression-time2
chord-progression-time3
chord-progression-time4
chord-progression-time5
chord-progression-time6
chord-progression-time7
chord-progression-time8
chord-progression-time9
looper
med96
metro
noisey-sustained
noisey2
play-chord-saw1
play-chord-sin2
saw-diss
saw1
sin3
sine-tetra-diss
some-midis
voice-and-transpose-rand-set
voice-rand-set
#+end_example

*** eventually more complex, as you realize what your work will require
note, that this is for the Babel session for the "getting-started"
program. Maybe don't evaluate this unless you are working with a
strong sense of what your namespace situation is.

Note, that as [2015-04-14 Tue] the use of hyphens vs. underscore is at issue.


#+BEGIN_SRC clojure :session getting-started
;; (ns post-tonal-overtone.core
;;   (:use overtone.live
;;         overtone.inst.sampled-piano
;; 	post-tonal-overtone.set-class-data
;; ;;	post-tonal-overtone
;; ;;	org.clojure/math.combinatorics "0.1.1"
;; 	clojure.repl))
#+END_SRC

Note you can also just call this requirement in directly to whatever
namespace you happen to be in. Does this code cause nREPL to time out
for some reason?

#+BEGIN_SRC clojure :session getting-started
post_tonal_overtone.data.set_class_data/cmajtriads
#+END_SRC

#+RESULTS:
| 48 | 52 | 55 |
| 48 | 52 | 67 |
| 48 | 52 | 79 |
| 48 | 64 | 55 |
| 48 | 64 | 67 |
| 48 | 64 | 79 |
| 48 | 76 | 55 |
| 48 | 76 | 67 |
| 48 | 76 | 79 |
| 60 | 52 | 55 |
| 60 | 52 | 67 |
| 60 | 52 | 79 |
| 60 | 64 | 55 |
| 60 | 64 | 67 |
| 60 | 64 | 79 |
| 60 | 76 | 55 |
| 60 | 76 | 67 |
| 60 | 76 | 79 |
| 72 | 52 | 55 |
| 72 | 52 | 67 |
| 72 | 52 | 79 |
| 72 | 64 | 55 |
| 72 | 64 | 67 |
| 72 | 64 | 79 |
| 72 | 76 | 55 |
| 72 | 76 | 67 |
| 72 | 76 | 79 |

** test sound
*** a definst template (noise, non-pitched)
 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(definst noisey2 [attack 0.01 sustain 0.4 release 0.1 vol 0.4 length 3] 
  (* (env-gen (lin attack sustain release) 1 1 0 length FREE)
     (pink-noise) ; also have (white-noise) and others...
     vol))

(noisey2)
 #+END_SRC

 #+RESULTS:
 : #<instrument: noisey2>#<synth-node[loading]: user/noisey2 35>

*** definst can take an envelope for scaling the ugen output--using lin
use of lin presents several default keyword args. When called as an
argument for env-gen as is you will get these default values that
basically make for a "sharp" sound, i.e. no gentle entrance and ending
to the sound.

#+BEGIN_SRC clojure 
(lin :attack :sustain :release :level :curve)
#+END_SRC

#+RESULTS:
| 0 | 3 | -99 | -99 | :curve | :attack | 1 | 0 | :curve | :release | 1 | 0 | 0 | 1 | 1 | 0 |

