src/post_tonal_overtone/org_files/html-versions/first-steps.html

<li><a id="orgheadline7"></a>clojure.core<br  /><div class="outline-text-5" id="text-1-1-2-6">
<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">clojure.core</span>)
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.1.3</span> simple namespaces moves</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
For the moment, let's see what evaluating the following reveals.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">in-ns</span> 'user)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #DCDCCC; font-weight: bold;">*ns*</span>
</pre>
</div>

<p>
You'll discover that it is good practice to define a namespace at the
beginning of a file of related code. If you are working through this
in emacs org-mode babel, evaluate this now (The results of executing
on or within block will be telling).
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">in-ns</span> '<span style="color: #7CB8BB;">post_tonal_overtone.core</span>)
</pre>
</div>

<p>
You can either call this in the CIDER repl, or from within a org-babel
block.
</p>

<p>
Now, you should check to see what went down (especially in a babel
block where it might not be obvious). If you have called code in the
REPL but not within a Babel block you may not always be in the right
place (note a discrepancy here).
</p>

<pre class="example">
#&lt;Namespace post_tonal_overtone.core&gt;
</pre>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #DCDCCC; font-weight: bold;">*ns*</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(dir <span style="color: #7CB8BB;">post_tonal_overtone.core</span>)
</pre>
</div>




<pre class="example">
chord-progression-time1
chord-progression-time10
chord-progression-time2
chord-progression-time3
chord-progression-time4
chord-progression-time5
chord-progression-time6
chord-progression-time7
chord-progression-time8
chord-progression-time9
looper
med96
metro
noisey-sustained
noisey2
play-chord-saw1
play-chord-sin2
saw-diss
saw1
sin3
sine-tetra-diss
some-midis
voice-and-transpose-rand-set
voice-rand-set
</pre>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">1.1.4</span> eventually more complex, as you realize what your work will require</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
note, that this is for the Babel session for the "getting-started"
program. Maybe don't evaluate this unless you are working with a
strong sense of what your namespace situation is.
</p>

<p>
Note, that as <span class="timestamp-wrapper"><span class="timestamp">[2015-04-14 Tue] </span></span> the use of hyphens vs. underscore is at issue.
</p>


<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(ns post-tonal-overtone.core</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">(</span><span style="color: #BFEBBF;">:use</span><span style="color: #7F9F7F;"> overtone.live</span>
<span style="color: #5F7F5F;">;;         </span><span style="color: #7F9F7F;">overtone.inst.sampled-piano</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">post-tonal-overtone.set-class-data</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">;;   post-tonal-overtone</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">;;   org.clojure/math.combinatorics "0.1.1"</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">clojure.repl))</span>
</pre>
</div>

<p>
Note you can also just call this requirement in directly to whatever
namespace you happen to be in. Does this code cause nREPL to time out
for some reason?
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #7CB8BB;">post_tonal_overtone.data.set_class_data</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>cmajtriads
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">1.2</span> test sound</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">1.2.1</span> a definst template (noise, non-pitched)</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">noisey2</span> [attack 0.01 sustain 0.4 release 0.1 vol 0.4 length 3] 
  (* (env-gen (lin attack sustain release) 1 1 0 length <span style="color: #BFEBBF;">FREE</span>)
     (pink-noise) <span style="color: #7F9F7F;">; also have (white-noise) and others...</span>
     vol))

(noisey2)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">1.2.2</span> definst can take an envelope for scaling the ugen output&#x2013;using lin</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
use of lin presents several default keyword args. When called as an
argument for env-gen as is you will get these default values that
basically make for a "sharp" sound, i.e. no gentle entrance and ending
to the sound.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(lin <span style="color: #BFEBBF;">:attack</span> <span style="color: #BFEBBF;">:sustain</span> <span style="color: #BFEBBF;">:release</span> <span style="color: #BFEBBF;">:level</span> <span style="color: #BFEBBF;">:curve</span>)
</pre>
</div>
</div>
</div>
