src/post_tonal_overtone/org_files/first-steps.org
*** scale output using an env-gen
#+BEGIN_SRC clojure
;; not for evaluating?
(env-gen :envelope :gate :level-scale :level-bias :time-scale :action)
#+END_SRC

#+RESULTS:

*** define constant pink noise
You'll have to stop this on your own (if you want to!) by evaluating
the ~(stop)~ function below.

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(definst noisey-sustained [vol 0.5] 
  (* (pink-noise) ; also have (white-noise) and others...
     vol))

(noisey-sustained 1)
  #+END_SRC

  #+RESULTS:
  : #<instrument: noisey-sustained>#<synth-node[loading]: user/noisey-sustained 42>

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(stop)
  #+END_SRC

  #+RESULTS:
  : nil

Since you might have to do this frequently (that is, stop some playing
sound), it's wise to create an emacs function or macro to invoke this quickly.
* shaping some basic sounds
What sounds can you make with your computer? And how easily can you
figure out what they are and how to use them? I like to start with
white-noise.
** play long white noise
Let's see how we can call the above function with some arguments.
*** example--10 second version, long release?

Experimenting with different parameter values reveals that there are
some mechanics to the ~env-gen~ function. What's happens when we use
an attack of '0.4' and a sustain of '0?'

Sounds like a pleasant (and quiet, depending on how loud your system is
turned up) wave just rolled up?
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(noisey2 :attack 0.4 :sustain 0 :release 0.7 :vol 0.3 :length 10)
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: user/noisey2 43>


Sounds like percussion now?
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(noisey2 :attack 0 :sustain 0 :release 0.1 :vol 0.3 :length 1)
  #+END_SRC

  #+RESULTS:
  : #<synth-node[loading]: user/noisey2 44>

Wouldn't it be nice to be able to experiment with different values for
these things in some way other than typing values at the keyboard?
We'll have to get to this.

** build some 'pitched' synth instruments for playing chords
Really understanding =definst= will take some time. Here are some
quick sound examples that use =sin-osc= and =saw= to produce those
respective waveforms, which now will allow us to use actual
frequencies and pitches.

 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(definst sin1 [freq 880 attack 0.1 sustain 0.15 release 0.25 vol 0.4 length 5]
  (* (env-gen (lin attack sustain release) 1 1 0 length FREE)
     (sin-osc freq)
     vol))

(sin1)
 #+END_SRC

 #+RESULTS:
 : #<instrument: sin1>#<synth-node[loading]: user/sin1 49>

You can also give sin1 an argument:

 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(sin1 330)
 #+END_SRC

 #+RESULTS:
 : #<synth-node[loading]: user/sin1 50>

 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(definst saw1 [freq 330 attack 0.3 sustain 0.15 release 0.25 vol 0.2 length 5]
  (* (env-gen (lin attack sustain release) 1 1 0 length FREE)
     (saw freq)
     vol))

(saw1)
 #+END_SRC

 #+RESULTS:
 : #<instrument: saw1>#<synth-node[loading]: user/saw1 55>

** saw waves are harmonically rich--sine waves not so much...
The above options give us comparatively straightforward sounds.
However, they are not necessarily very pleasant or interesting by
themselves. If you're interested right now, we can play around a
little with a saw wave, just to give any idea of other ways you can
get sounds.

Play with evaluating both of these repeatedly. Because we are now
using a filtering object--and most importantly, because there is now
some randomness in the equation--you now start to hear a slightly
different quality to the sound, as well as some slight variations as
you progressively evaluate it.

 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(definst saw2 [freq 220 attack 0.3 sustain 0.15 release 0.25 vol 0.1 length 5]
  (* (bpf (* (env-gen (lin attack sustain release) 1 1 0 length FREE)
             (saw freq)
             (* 10 (inc (rand-int 10)))
             (* 0.01 (inc (rand-int 10)))))
     vol))


(saw2)
 #+END_SRC

 #+RESULTS:
 : #<instrument: saw2>#<synth-node[loading]: user/saw2 63>

 #+BEGIN_EXAMPLE
evaluating clojure/babel blocks can be annoying if they block your navigation in emacs. If this happens, try evaluating the blocks that don't contain the definst as well as the function call.
 #+END_EXAMPLE

#+BEGIN_SRC clojure
(saw2)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/saw2 76>

Just to compare against the unfiltered version with no envelope:
#+BEGIN_SRC clojure
(demo 0.5 (saw 220))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 72>

** here's a use of a built-in overtone library for making choices algorithmically
#+BEGIN_SRC clojure
(saw2 (overtone.algo.chance/ranged-rand 300 302) :vol 0.3)
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/saw2 81>

Giving it a different envelope begins to give it another quality as
well, as if a kind simple little synthesizer.
#+BEGIN_SRC clojure
(demo (bpf (* (env-gen (lin 0.0 0.2 0.3)) (saw)) 800 0.3))
#+END_SRC

#+RESULTS:
: #<synth-node[loading]: user/audition-synth 87>

* begin creating scheduled events
To really make music, we're going to have to understand how to get
things to play in time, without simply triggering everything at the
REPL. That means we are going to have to schedule things.

And to really understand how to use scheduling we'll ultimately need
to look at some other files that are dedicated to this pursuit. For
now, here are some quick examples
** basic example
There are two keys functions to wrap your head around: =at= and
=metro.= Let's start with =at=.

