src/post_tonal_overtone/org_files/html-versions/first-steps.html

<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14"><span class="section-number-4">1.2.3</span> scale output using an env-gen</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">not for evaluating?</span>
(env-gen <span style="color: #BFEBBF;">:envelope</span> <span style="color: #BFEBBF;">:gate</span> <span style="color: #BFEBBF;">:level-scale</span> <span style="color: #BFEBBF;">:level-bias</span> <span style="color: #BFEBBF;">:time-scale</span> <span style="color: #BFEBBF;">:action</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-4">
<h4 id="orgheadline15"><span class="section-number-4">1.2.4</span> define constant pink noise</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
You'll have to stop this on your own (if you want to!) by evaluating
the <code>(stop)</code> function below.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">noisey-sustained</span> [vol 0.5] 
  (* (pink-noise) <span style="color: #7F9F7F;">; also have (white-noise) and others...</span>
     vol))

(noisey-sustained 1)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>

<p>
Since you might have to do this frequently (that is, stop some playing
sound), it's wise to create an emacs function or macro to invoke this quickly.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-2">
<h2 id="orgheadline23"><span class="section-number-2">2</span> shaping some basic sounds</h2>
<div class="outline-text-2" id="text-2">
<p>
What sounds can you make with your computer? And how easily can you
figure out what they are and how to use them? I like to start with
white-noise.
</p>
</div>
<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">2.1</span> play long white noise</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Let's see how we can call the above function with some arguments.
</p>
</div>
<div id="outline-container-orgheadline18" class="outline-4">
<h4 id="orgheadline18"><span class="section-number-4">2.1.1</span> example&#x2013;10 second version, long release?</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Experimenting with different parameter values reveals that there are
some mechanics to the <code>env-gen</code> function. What's happens when we use
an attack of '0.4' and a sustain of '0?'
</p>

<p>
Sounds like a pleasant (and quiet, depending on how loud your system is
turned up) wave just rolled up?
</p>
<div class="org-src-container">

<pre class="src src-clojure">(noisey2 <span style="color: #BFEBBF;">:attack</span> 0.4 <span style="color: #BFEBBF;">:sustain</span> 0 <span style="color: #BFEBBF;">:release</span> 0.7 <span style="color: #BFEBBF;">:vol</span> 0.3 <span style="color: #BFEBBF;">:length</span> 10)
</pre>
</div>


<p>
Sounds like percussion now?
</p>
<div class="org-src-container">

<pre class="src src-clojure">(noisey2 <span style="color: #BFEBBF;">:attack</span> 0 <span style="color: #BFEBBF;">:sustain</span> 0 <span style="color: #BFEBBF;">:release</span> 0.1 <span style="color: #BFEBBF;">:vol</span> 0.3 <span style="color: #BFEBBF;">:length</span> 1)
</pre>
</div>

<p>
Wouldn't it be nice to be able to experiment with different values for
these things in some way other than typing values at the keyboard?
We'll have to get to this.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">2.2</span> build some 'pitched' synth instruments for playing chords</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Really understanding <code>definst</code> will take some time. Here are some
quick sound examples that use <code>sin-osc</code> and <code>saw</code> to produce those
respective waveforms, which now will allow us to use actual
frequencies and pitches.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">sin1</span> [freq 880 attack 0.1 sustain 0.15 release 0.25 vol 0.4 length 5]
  (* (env-gen (lin attack sustain release) 1 1 0 length <span style="color: #BFEBBF;">FREE</span>)
     (sin-osc freq)
     vol))

(sin1)
</pre>
</div>

<p>
You can also give sin1 an argument:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(sin1 330)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">saw1</span> [freq 330 attack 0.3 sustain 0.15 release 0.25 vol 0.2 length 5]
  (* (env-gen (lin attack sustain release) 1 1 0 length <span style="color: #BFEBBF;">FREE</span>)
     (saw freq)
     vol))

(saw1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">2.3</span> saw waves are harmonically rich&#x2013;sine waves not so much&#x2026;</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The above options give us comparatively straightforward sounds.
However, they are not necessarily very pleasant or interesting by
themselves. If you're interested right now, we can play around a
little with a saw wave, just to give any idea of other ways you can
get sounds.
</p>

<p>
Play with evaluating both of these repeatedly. Because we are now
using a filtering object&#x2013;and most importantly, because there is now
some randomness in the equation&#x2013;you now start to hear a slightly
different quality to the sound, as well as some slight variations as
you progressively evaluate it.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">saw2</span> [freq 220 attack 0.3 sustain 0.15 release 0.25 vol 0.1 length 5]
  (* (bpf (* (env-gen (lin attack sustain release) 1 1 0 length <span style="color: #BFEBBF;">FREE</span>)
             (saw freq)
             (* 10 (inc (rand-int 10)))
             (* 0.01 (inc (rand-int 10)))))
     vol))


(saw2)
</pre>
</div>

<pre class="example">
evaluating clojure/babel blocks can be annoying if they block your navigation in emacs. If this happens, try evaluating the blocks that don't contain the definst as well as the function call.
</pre>

<div class="org-src-container">

<pre class="src src-clojure">(saw2)
</pre>
</div>

<p>
Just to compare against the unfiltered version with no envelope:
</p>
<div class="org-src-container">

<pre class="src src-clojure">(demo 0.5 (saw 220))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">2.4</span> here's a use of a built-in overtone library for making choices algorithmically</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-clojure">(saw2 (<span style="color: #7CB8BB;">overtone.algo.chance</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>ranged-rand 300 302) <span style="color: #BFEBBF;">:vol</span> 0.3)
</pre>
</div>

<p>
Giving it a different envelope begins to give it another quality as
well, as if a kind simple little synthesizer.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(demo (bpf (* (env-gen (lin 0.0 0.2 0.3)) (saw)) 800 0.3))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline31" class="outline-2">
<h2 id="orgheadline31"><span class="section-number-2">3</span> begin creating scheduled events</h2>
<div class="outline-text-2" id="text-3">
<p>
To really make music, we're going to have to understand how to get
things to play in time, without simply triggering everything at the
REPL. That means we are going to have to schedule things.
</p>

<p>
And to really understand how to use scheduling we'll ultimately need
to look at some other files that are dedicated to this pursuit. For
now, here are some quick examples
</p>
</div>
<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">3.1</span> basic example</h3>
<div class="outline-text-3" id="text-3-1">
<p>
There are two keys functions to wrap your head around: <code>at</code> and
<code>metro.</code> Let's start with <code>at</code>.
</p>
</div>
