src/post_tonal_overtone/org_files/first-steps.org
*** use 'at' to schedule chord events
Simply, we can use the =at= function to schedule some events relative
to a given starting point (which will be determined by calling =now=).
Note that below, we are hard-coding in the offsets, which means that
this won't be especially useful for more than a few listens.

However, it neatly demonstrates that time can be quite nicely
quanitified--here in milliseconds.

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
;; first let's make an instrument to play chords.
;; note, we are using midi->hz because synths will tend to expect
;; arguments in hz

;; Note, that sin1 was defined early

(defn play-chord-sin2 [a-chord]
  (doseq [note a-chord] (sin1 (midi->hz note))))
 #+END_SRC

  #+RESULTS:
  : #'user/play-chord-sin2

Here is the sine instrument at work, demonstrating the fact that it
will take midi number arguments and convert it to Hertz.

 #+BEGIN_SRC clojure :session getting-started :tangle yes 
;; bring the dogs running!
(sin1 (midi->hz 96))
 #+END_SRC

 #+RESULTS:
 : #<synth-node[loading]: user/sin1 88>

And here's an interesting 7-note chord
 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(play-chord-sin2 [64 76 81 86 91 96 101])
 #+END_SRC

 #+RESULTS:
 : nil

Now, here's a progression. 
 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time1 []
  (let [time (now)]
    (at time          (play-chord-sin2 [68 81 46 50 88]))
    (at (+ 2000 time) (play-chord-sin2 [80 69 46 73 86]))
    (at (+ 4000 time) (play-chord-sin2 [68 59 48 85 64]))
    (at (+ 6000 time) (play-chord-sin2 [68 69 72 87 52]))
    (at (+ 8000 time) (play-chord-sin2 [89 55 45 60 62]))))

(chord-progression-time1)
  #+END_SRC

 #+RESULTS:
 : #'user/chord-progression-time1nil

Note that having to type all this out every time would be a pain. And
ultimately, there are a lot of things we might like to change about
this. For one thing, wouldn't it be nice to know more about those
chords?

And of course, most importantly, we want to make it easier to work
with such progressions. One way to do that is to make progression that
deal with time more robustly. We'll get there.

(When using this file from within emacs, we can take advantage of
org-mode and emacs kmacro and functions to make it a little more
fluid, eventually maybe even treating it like an instrument!)

** schedule a single event
*** test out single event versions using 'at'
Here's a test of making a chord progression function that take an
instrument (with a whole series of default keyword arguments
hard-coded in--eek!) as an argument instead.
 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time2 [inst]
  (let [time (now)]
    (at time (inst :attack 0.15 :sustain 0.2 :release 0.4 :vol 0.5 :length 10))))

(chord-progression-time2 sin1)
 #+END_SRC

 #+RESULTS:
 : #'user/chord-progression-time2#<synth-node[loading]: user/sin1 121>


 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(chord-progression-time2 saw2)
 #+END_SRC

 #+RESULTS:
 : #<synth-node[loading]: user/saw2 122>

** how do we establish a beat for scheduling events using metronome?

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(def metro (metronome 60))
  #+END_SRC

  #+RESULTS:
  : #'user/metro

Understanding how to use the values that this produces gets at the
part of the overtone language that is at the heart of scheduling, and
is crucial to doing musical things--to the extent that music happens
in time, or according to some constructed notion of time.

We will get to this. For now just observe that we have a special type
of named thing here:

#+BEGIN_SRC clojure
(type metro)
(metro)
#+END_SRC

#+RESULTS:
: overtone.music.rhythm.Metronome6

*** Preparing dissonant chords 
(Note: this functionality has largely been superseded elsewhere)

The function =sine-tetra-diss= will provide sets of pitches to a sine
instrument. The pitches are chosen from a local file (which is aliased
with =set-class.= We'll get to explaining this soon.)

Note that it also calls a special function for making voicings. There
is some functionality like this in overtone already, namely a
=rand-chord= function.

 #+BEGIN_SRC clojure :session getting-started :tangle yes 
;; A function to work with sets
(defn voice-and-transpose-rand-set [set-type tn-level]
  (let [set (rand-nth set-type)
        voiced-set (map #(+ (rand-nth [36 48 60 72]) %) set)
        transposed-set (map #(+ tn-level %) voiced-set)
        set-voicing-group (list set voiced-set tn-level transposed-set)]
    (do
      (println set-voicing-group)
      (last set-voicing-group))))

(defn sine-tetra-diss []
  (doseq [notes (voice-and-transpose-rand-set ; voicing
                 set-class/tetrachords
                       (rand-int 12))]
    (sin1 (midi->hz notes))))

(sine-tetra-diss)
 #+END_SRC

 #+RESULTS:
 : #'post_tonal_overtone.core/voice-and-transpose-rand-set#'post_tonal_overtone.core/sine-tetra-dissnil

