src/post_tonal_overtone/org_files/html-versions/first-steps.html

<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">3.1.1</span> use 'at' to schedule chord events</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Simply, we can use the <code>at</code> function to schedule some events relative
to a given starting point (which will be determined by calling <code>now</code>).
Note that below, we are hard-coding in the offsets, which means that
this won't be especially useful for more than a few listens.
</p>

<p>
However, it neatly demonstrates that time can be quite nicely
quanitified&#x2013;here in milliseconds.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">first let's make an instrument to play chords.</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">note, we are using midi-&gt;hz because synths will tend to expect</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">arguments in hz</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Note, that sin1 was defined early</span>

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">play-chord-sin2</span> [a-chord]
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note a-chord] (sin1 (midi-&gt;hz note))))
</pre>
</div>

<p>
Here is the sine instrument at work, demonstrating the fact that it
will take midi number arguments and convert it to Hertz.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">bring the dogs running!</span>
(sin1 (midi-&gt;hz 96))
</pre>
</div>

<p>
And here's an interesting 7-note chord
</p>
<div class="org-src-container">

<pre class="src src-clojure">(play-chord-sin2 [64 76 81 86 91 96 101])
</pre>
</div>

<p>
Now, here's a progression. 
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time1</span> []
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [time (now)]
    (at time          (play-chord-sin2 [68 81 46 50 88]))
    (at (+ 2000 time) (play-chord-sin2 [80 69 46 73 86]))
    (at (+ 4000 time) (play-chord-sin2 [68 59 48 85 64]))
    (at (+ 6000 time) (play-chord-sin2 [68 69 72 87 52]))
    (at (+ 8000 time) (play-chord-sin2 [89 55 45 60 62]))))

(chord-progression-time1)
</pre>
</div>

<p>
Note that having to type all this out every time would be a pain. And
ultimately, there are a lot of things we might like to change about
this. For one thing, wouldn't it be nice to know more about those
chords?
</p>

<p>
And of course, most importantly, we want to make it easier to work
with such progressions. One way to do that is to make progression that
deal with time more robustly. We'll get there.
</p>

<p>
(When using this file from within emacs, we can take advantage of
org-mode and emacs kmacro and functions to make it a little more
fluid, eventually maybe even treating it like an instrument!)
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">3.2</span> schedule a single event</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">3.2.1</span> test out single event versions using 'at'</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Here's a test of making a chord progression function that take an
instrument (with a whole series of default keyword arguments
hard-coded in&#x2013;eek!) as an argument instead.
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time2</span> [inst]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [time (now)]
    (at time (inst <span style="color: #BFEBBF;">:attack</span> 0.15 <span style="color: #BFEBBF;">:sustain</span> 0.2 <span style="color: #BFEBBF;">:release</span> 0.4 <span style="color: #BFEBBF;">:vol</span> 0.5 <span style="color: #BFEBBF;">:length</span> 10))))

(chord-progression-time2 sin1)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(chord-progression-time2 saw2)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">3.3</span> how do we establish a beat for scheduling events using metronome?</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">metro</span> (metronome 60))
</pre>
</div>

<p>
Understanding how to use the values that this produces gets at the
part of the overtone language that is at the heart of scheduling, and
is crucial to doing musical things&#x2013;to the extent that music happens
in time, or according to some constructed notion of time.
</p>

<p>
We will get to this. For now just observe that we have a special type
of named thing here:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(type metro)
(metro)
</pre>
</div>
</div>

<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">3.3.1</span> Preparing dissonant chords</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
(Note: this functionality has largely been superseded elsewhere)
</p>

<p>
The function <code>sine-tetra-diss</code> will provide sets of pitches to a sine
instrument. The pitches are chosen from a local file (which is aliased
with <code>set-class.</code> We'll get to explaining this soon.)
</p>

<p>
Note that it also calls a special function for making voicings. There
is some functionality like this in overtone already, namely a
<code>rand-chord</code> function.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">A function to work with sets</span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">voice-and-transpose-rand-set</span> [set-type tn-level]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [set (rand-nth set-type)
        voiced-set (map #(+ (rand-nth [36 48 60 72]) <span style="color: #DFAF8F;">%</span>) set)
        transposed-set (map #(+ tn-level <span style="color: #DFAF8F;">%</span>) voiced-set)
        set-voicing-group (list set voiced-set tn-level transposed-set)]
    (<span style="color: #F0DFAF; font-weight: bold;">do</span>
      (println set-voicing-group)
      (last set-voicing-group))))

(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">sine-tetra-diss</span> []
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [notes (voice-and-transpose-rand-set <span style="color: #7F9F7F;">; voicing</span>
                 <span style="color: #7CB8BB;">set-class</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>tetrachords
                       (rand-int 12))]
    (sin1 (midi-&gt;hz notes))))

(sine-tetra-diss)
</pre>
</div>
</div>
</div>
