src/post_tonal_overtone/org_files/first-steps.org
*** Schedule dissonant chords
Define and use a chord progression player--use 'apply-at.'

Note that this uses the sine-tetra-diss as a hard-coded 'instrument',
or rather an instrumentalist. As well, we call the progression with
the metro we defined above, which means that the tempo is determined
from there.

There one major thing not described here, which is how this can just
keep going. We'll get to that (it involves recursion, and that
=apply-at=). The main purpose here is to give us something interesting
to listen to.


  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time8 [nome]
  (let [beat (nome)]
    (at (nome beat) (sine-tetra-diss))
    (apply-at (nome (inc beat)) chord-progression-time8 nome [])))

;; to paraphrase "A Foggy Day", how long can this thing last?
(chord-progression-time8 metro)
  #+END_SRC

  #+RESULTS:
  : #'post_tonal_overtone.core/chord-progression-time8#<ScheduledJob id: 1, created-at: Mon 09:08:21s, initial-delay: 1964, desc: "Overtone delayed fn", scheduled? true>

How might we want to modify this? One of the first things we should
take care of is the ability to pass in a different instrument. That
is, playing chord progressions is a different concern from the sound
that will render those.

A lot depends on the nature of that instrument, which in this case
performs a series of calculations that are encapsulated and abstracted
away from our view. But a lot also depends on the means by which each
new chord is scheduled according to the relentless march of the
metronome. 

Since a metronome (or at least the old-fashioned physical ones) is
quite truly a mechanical thing, we are only going to get out a kind of
mechanical-sounding series of events. How we eventually improve this
is another matter.
* miscellaneous experiments 
The rest is mostly slight variation on the above. In a sense it shows 
the process that may have been used to arrive at the above, as these
various progressions were numbered, and the above one (which is the
preferred of these others) was number 8 in the series.

That will have to wait till we begin building a voice-leading engine,
and especially when we consider preparing scores of musical events all
at once. In such a situation, we are modeling musical time using a
rather different technique.

** Experiment with progression based on sawtooth synths
*** use sawtooth synths to play various chords
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(map (rand-nth [saw1 saw2]) (map #(midi->hz %) (last (voice-rand-set set-class/pentachords))))
  #+END_SRC

  #+RESULTS:
  : '(#<synth-node(loading): post_tonal_overtone.core/saw2 251> #<synth-node(loading): post_tonal_overtone.core/saw2 252> #<synth-node(loading): post_tonal_overtone.core/saw2 253> #<synth-node(loading): post_tonal_overtone.core/saw2 254> #<synth-node(loading): post_tonal_overtone.core/saw2 255>)

*** chord progression number 3--sawtooth intensive

  a lot of repetition with this one
  # apply-at appears to cause problems when attempting to
  # call a functions that takes more than one argument

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time3 [nome]
  (let [beat (nome)]
    (at (nome beat)
        (doseq [note (rand-nth [[60 61 62] [60 49 51 55 44]])]
          (saw1 (midi->hz note))))
    (apply-at (nome (inc beat)) chord-progression-time3 nome [])))
  #+END_SRC

  #+RESULTS:
  : #'post-tonal-overtone.core/chord-progression-time3

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(chord-progression-time3 metro)
  #+END_SRC

  #+RESULTS:
  : #<ScheduledJob id: 1, created-at: Tue 05:47:31s, initial-delay: 1872, desc: "Overtone delayed fn", scheduled? true>

*** chord progression 4
  # loops through random tetrachords without printing

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time4 [nome]
  (let [beat (nome)]
    (at (nome beat)
        (doseq [notes (voice-and-transpose-rand-set ; voicing
                       *tetrachords* ; set-type
                       (rand-int 12))]
          (saw1 (midi->hz notes))))
    (apply-at (nome (inc beat)) chord-progression-time4 nome [])))
  #+END_SRC

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(chord-progression-time4 metro)
  #+END_SRC

** chord progression 5
  # hack to get around the apply-at problem
use a set of pitched chords
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(def some-midis [[72 61 50 46] [60 49 51 55 44] [74 63 52 68] [42 79
70 61]])
  #+END_SRC

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time5 [nome]
  (let [beat (nome)]
    (at (nome beat)
        (doseq [note (rand-nth some-midis)]
          (saw1 (midi->hz note))))
    (apply-at (nome (inc beat)) chord-progression-time5 nome [])))
  #+END_SRC

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(chord-progression-time5 metro)
  #+END_SRC

*** define a sawtooth random chord player
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn saw-diss []
  (doseq [notes (voice-and-transpose-rand-set ; voicing
                       *tetrachords* ; set-type
                       (rand-int 12))]
    (saw1 (midi->hz notes))))
  #+END_SRC


  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(saw-diss)
  #+END_SRC



  # also good, only prints first chord

*** chord progression 6
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time6 [nome]
  (let [beat (nome)]
    (at (nome beat) (saw-diss))
    (apply-at (nome (inc beat)) chord-progression-time6 nome [])))
  #+END_SRC

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(chord-progression-time6 metro)
  #+END_SRC

*** chord progression 7
  # broken? because of apply-at problem?


  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time7 [nome sound]
  (let [beat (nome)]
    (at (nome beat) sound)
    (apply-at (nome (inc beat)) chord-progression-time7 nome sound
[])))
  #+END_SRC

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(chord-progression-time7 metro saw-diss)
  #+END_SRC

