src/post_tonal_overtone/org_files/html-versions/first-steps.html

<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">3.3.2</span> Schedule dissonant chords</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Define and use a chord progression player&#x2013;use 'apply-at.'
</p>

<p>
Note that this uses the sine-tetra-diss as a hard-coded 'instrument',
or rather an instrumentalist. As well, we call the progression with
the metro we defined above, which means that the tempo is determined
from there.
</p>

<p>
There one major thing not described here, which is how this can just
keep going. We'll get to that (it involves recursion, and that
<code>apply-at</code>). The main purpose here is to give us something interesting
to listen to.
</p>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time8</span> [nome]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
    (at (nome beat) (sine-tetra-diss))
    (apply-at (nome (inc beat)) chord-progression-time8 nome [])))

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">to paraphrase "A Foggy Day", how long can this thing last?</span>
(chord-progression-time8 metro)
</pre>
</div>

<p>
How might we want to modify this? One of the first things we should
take care of is the ability to pass in a different instrument. That
is, playing chord progressions is a different concern from the sound
that will render those.
</p>

<p>
A lot depends on the nature of that instrument, which in this case
performs a series of calculations that are encapsulated and abstracted
away from our view. But a lot also depends on the means by which each
new chord is scheduled according to the relentless march of the
metronome. 
</p>

<p>
Since a metronome (or at least the old-fashioned physical ones) is
quite truly a mechanical thing, we are only going to get out a kind of
mechanical-sounding series of events. How we eventually improve this
is another matter.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline44" class="outline-2">
<h2 id="orgheadline44"><span class="section-number-2">4</span> miscellaneous experiments</h2>
<div class="outline-text-2" id="text-4">
<p>
The rest is mostly slight variation on the above. In a sense it shows 
the process that may have been used to arrive at the above, as these
various progressions were numbered, and the above one (which is the
preferred of these others) was number 8 in the series.
</p>

<p>
That will have to wait till we begin building a voice-leading engine,
and especially when we consider preparing scores of musical events all
at once. In such a situation, we are modeling musical time using a
rather different technique.
</p>
</div>

<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">4.1</span> Experiment with progression based on sawtooth synths</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-orgheadline32" class="outline-4">
<h4 id="orgheadline32"><span class="section-number-4">4.1.1</span> use sawtooth synths to play various chords</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">

<pre class="src src-clojure">(map (rand-nth [saw1 saw2]) (map #(midi-&gt;hz <span style="color: #DFAF8F;">%</span>) (last (voice-rand-set <span style="color: #7CB8BB;">set-class</span><span style="color: #DCDCCC; background-color: #3F3F3F;">/</span>pentachords))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline33" class="outline-4">
<h4 id="orgheadline33"><span class="section-number-4">4.1.2</span> chord progression number 3&#x2013;sawtooth intensive</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
a lot of repetition with this one
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time3</span> [nome]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
    (at (nome beat)
        (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note (rand-nth [[60 61 62] [60 49 51 55 44]])]
          (saw1 (midi-&gt;hz note))))
    (apply-at (nome (inc beat)) chord-progression-time3 nome [])))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(chord-progression-time3 metro)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34"><span class="section-number-4">4.1.3</span> chord progression 4</h4>
<div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time4</span> [nome]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
    (at (nome beat)
        (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [notes (voice-and-transpose-rand-set <span style="color: #7F9F7F;">; voicing</span>
                       <span style="color: #DFAF8F;">*tetrachords*</span> <span style="color: #7F9F7F;">; set-type</span>
                       (rand-int 12))]
          (saw1 (midi-&gt;hz notes))))
    (apply-at (nome (inc beat)) chord-progression-time4 nome [])))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(chord-progression-time4 metro)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">4.2</span> chord progression 5</h3>
<div class="outline-text-3" id="text-4-2">
<p>
use a set of pitched chords
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">some-midis</span> [[72 61 50 46] [60 49 51 55 44] [74 63 52 68] [42 79
70 61]])
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time5</span> [nome]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
    (at (nome beat)
        (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note (rand-nth some-midis)]
          (saw1 (midi-&gt;hz note))))
    (apply-at (nome (inc beat)) chord-progression-time5 nome [])))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(chord-progression-time5 metro)
</pre>
</div>
</div>

<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">4.2.1</span> define a sawtooth random chord player</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">saw-diss</span> []
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [notes (voice-and-transpose-rand-set <span style="color: #7F9F7F;">; voicing</span>
                       <span style="color: #DFAF8F;">*tetrachords*</span> <span style="color: #7F9F7F;">; set-type</span>
                       (rand-int 12))]
    (saw1 (midi-&gt;hz notes))))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(saw-diss)
</pre>
</div>
</div>
</div>



<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37"><span class="section-number-4">4.2.2</span> chord progression 6</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time6</span> [nome]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
    (at (nome beat) (saw-diss))
    (apply-at (nome (inc beat)) chord-progression-time6 nome [])))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(chord-progression-time6 metro)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline38" class="outline-4">
<h4 id="orgheadline38"><span class="section-number-4">4.2.3</span> chord progression 7</h4>
<div class="outline-text-4" id="text-4-2-3">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time7</span> [nome sound]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
    (at (nome beat) sound)
    (apply-at (nome (inc beat)) chord-progression-time7 nome sound
[])))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(chord-progression-time7 metro saw-diss)
</pre>
</div>
</div>
</div>
