src/post_tonal_overtone/org_files/first-steps.org
*** develop a looping function

 The use of "metro" hardcoded in causes problems?
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn looper [sound]    
    (let [beat (metro)]
        (at (metro beat) (sound))
        (apply-at (metro (inc beat)) looper sound [])))
  #+END_SRC

  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(looper (play-chord-sin2 '(80 69 46 73 86)))
  #+END_SRC

  #+RESULTS:

*** make a sawtooth chord player
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn play-chord-saw1 [a-chord]
  (doseq [note a-chord] (saw1 (midi->hz note))))
  #+END_SRC

  #+RESULTS:
  : #'post-tonal-overtone.core/play-chord-saw1

*** define a preselected set of chords for progression 9
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time9 []
  (let [time (now)]
    (at time          (play-chord-saw1 [68 81 46 50 88]))
    (at (+ 2000 time) (play-chord-saw1 [80 69 46 73 86]))
    (at (+ 4000 time) (play-chord-saw1 [68 59 48 85 64]))
    (at (+ 6000 time) (play-chord-saw1 [68 69 72 87 52]))
    (at (+ 8000 time) (play-chord-saw1 [89 55 45 60 62]))))
  #+END_SRC

  #+RESULTS:
  : #'post-tonal-overtone.core/chord-progression-time9


  #+BEGIN_SRC clojure :session getting-started :tangle yes             
(chord-progression-time9)
  #+END_SRC

  #+RESULTS:
  : nil

*** refactor chord progressions to use a player-fn
  #+BEGIN_SRC clojure :session getting-started :tangle yes 
(defn chord-progression-time10 [player-fn]
  (let [time (now)]
    (at (+ 0.00 time) (player-fn [68 81 46 50 88]))
    (at (+ 2000 time) (player-fn [80 69 46 73 86]))
    (at (+ 4000 time) (player-fn [68 59 48 85 64]))
    (at (+ 6000 time) (player-fn [68 69 72 87 52]))
    (at (+ 8000 time) (player-fn [89 55 45 60 62]))))
  #+END_SRC


  #+BEGIN_SRC clojure :session getting-started :tangle yes             
(chord-progression-time10 play-chord-saw1)
  #+END_SRC

* from the 'sequencing' wiki tutorial
More typically, people like to listen to drum beats repeat, rather
than endless strings of dissonant chords.
** use kick on each beat of a metronome
#+BEGIN_SRC clojure
(def kick (sample (freesound-path 2086)))

; setup a tempo for our metronome to use
(def forty-bpm (metronome 40))

; this function will play our sound at whatever tempo we've set our metronome to 
(defn looper [nome sound]    
    (let [beat (nome)]
        (at (nome beat) (sound))
        (apply-by (nome (inc beat)) looper nome sound [])))

; turn on the metronome
(looper forty-bpm kick)
#+END_SRC

#+RESULTS:
: #'post-tonal-overtone.core/kick#'post-tonal-overtone.core/one-twenty-bpm#'post-tonal-overtone.core/looper#<ScheduledJob id: 1, created-at: Mon 05:02:32s, initial-delay: 2694, desc: "Overtone delayed fn", scheduled? true>
#+BEGIN_SRC clojure
(stop)

#+END_SRC

#+RESULTS:
: nil

** startup a metronome and check in with its beats as it runs
#+BEGIN_SRC clojure
; to get a feel for how the metronome works, try defining one at the REPL
(def nome (metronome 200))
#+END_SRC

#+BEGIN_SRC clojure
(nome)
#+END_SRC

#+RESULTS:
: 284

#+BEGIN_SRC clojure :session getting-started
; setup a tempo for our metronome to use
(def forty-bpm (metronome 40))

; this function will play our sound at whatever tempo we've set our metronome to 
(defn looper [nome sound]    
    (let [beat (nome)]
        (at (nome beat) (sound))
        (apply-by (nome (inc beat)) looper nome sound [])))

;; turn on the metronome 
;; uh, where is 'piano' anything defined?

#+END_SRC

#+RESULTS:
: #'post-tonal-overtone.core/forty-bpm#'post-tonal-overtone.core/looper

#+BEGIN_SRC clojure
(defn foo [t freq]
  (at t (sin1 freq))
  (let [next-t (+ t 3000)
        next-f (+ freq 10)]
    (apply-by next-t #'foo [next-t next-f])))

(foo (now) 40)
#+END_SRC

#+RESULTS:
: #<ScheduledJob id: 1, created-at: Mon 05:35:33s, initial-delay: 0, desc: "Overtone delayed fn", scheduled? false>

this one, using sin1 as defined above, gradually steps up and up
through the frequencies from a given fundamental
#+BEGIN_SRC clojure
(defn foo [t freq]
  (at t (sin1 freq))
  (let [next-t (+ t 6000)
        next-f (+ freq 10)]
    (apply-by next-t #'foo [next-t next-f])))

(foo (now) 40)
#+END_SRC

* develop chords progressions (not "intro" enough--should be moved elsewhere?)
Because I am interested in post-tonal music, the following is about
how to incorporate such sounds into overtone projects.
** start working with post tonal set classes
*** getting-started babel session
note, this will only work if...you are in the proper namespace. What
that really means is...don't do this. 

Make sure that your data is loaded in a namespace declaration, i.e.
don't call this. There is a general preference for using a different
idiom than the following, which is very easy, but obscures some things
about how namespaces work.

 #+BEGIN_SRC clojure :session getting-started :tangle yes 
;; (load "set-class-data")
 #+END_SRC

While the above seems so innocent, it fails to reveal anything about
where this file lives, which means you will be able to use things
defined in there with a false sense of security. "Everything just
works!" Until it doesn't. 

What should you do instead? Use =require= which will be described more
elsewhere [link]

 #+RESULTS:
 : nil

#+COMMENT why do you want to hear an extremely high pitched sin wave?
 #+BEGIN_SRC clojure :session getting-started :tangle yes 
(definst med96 [] (* 0.01 (sin-osc (midi->hz 96))))

(med96)
 #+END_SRC

 #+RESULTS:
 : #<instrument: med96>
* miscellaneous utilities and problems
