src/post_tonal_overtone/org_files/html-versions/first-steps.html

<div id="outline-container-orgheadline39" class="outline-4">
<h4 id="orgheadline39"><span class="section-number-4">4.2.4</span> develop a looping function</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
The use of "metro" hardcoded in causes problems?
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">looper</span> [sound]    
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (metro)]
        (at (metro beat) (sound))
        (apply-at (metro (inc beat)) looper sound [])))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(looper (play-chord-sin2 '(80 69 46 73 86)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40"><span class="section-number-4">4.2.5</span> make a sawtooth chord player</h4>
<div class="outline-text-4" id="text-4-2-5">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">play-chord-saw1</span> [a-chord]
  (<span style="color: #F0DFAF; font-weight: bold;">doseq</span> [note a-chord] (saw1 (midi-&gt;hz note))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline41" class="outline-4">
<h4 id="orgheadline41"><span class="section-number-4">4.2.6</span> define a preselected set of chords for progression 9</h4>
<div class="outline-text-4" id="text-4-2-6">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time9</span> []
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [time (now)]
    (at time          (play-chord-saw1 [68 81 46 50 88]))
    (at (+ 2000 time) (play-chord-saw1 [80 69 46 73 86]))
    (at (+ 4000 time) (play-chord-saw1 [68 59 48 85 64]))
    (at (+ 6000 time) (play-chord-saw1 [68 69 72 87 52]))
    (at (+ 8000 time) (play-chord-saw1 [89 55 45 60 62]))))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(chord-progression-time9)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline42" class="outline-4">
<h4 id="orgheadline42"><span class="section-number-4">4.2.7</span> refactor chord progressions to use a player-fn</h4>
<div class="outline-text-4" id="text-4-2-7">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-progression-time10</span> [player-fn]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [time (now)]
    (at (+ 0.00 time) (player-fn [68 81 46 50 88]))
    (at (+ 2000 time) (player-fn [80 69 46 73 86]))
    (at (+ 4000 time) (player-fn [68 59 48 85 64]))
    (at (+ 6000 time) (player-fn [68 69 72 87 52]))
    (at (+ 8000 time) (player-fn [89 55 45 60 62]))))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(chord-progression-time10 play-chord-saw1)
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline47" class="outline-2">
<h2 id="orgheadline47"><span class="section-number-2">5</span> from the 'sequencing' wiki tutorial</h2>
<div class="outline-text-2" id="text-5">
<p>
More typically, people like to listen to drum beats repeat, rather
than endless strings of dissonant chords.
</p>
</div>
<div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">5.1</span> use kick on each beat of a metronome</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">kick</span> (sample (freesound-path 2086)))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">setup a tempo for our metronome to use</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">forty-bpm</span> (metronome 40))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">this function will play our sound at whatever tempo we've set our metronome to </span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">looper</span> [nome sound]    
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
        (at (nome beat) (sound))
        (apply-by (nome (inc beat)) looper nome sound [])))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">turn on the metronome</span>
(looper forty-bpm kick)
</pre>
</div>
<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">5.2</span> startup a metronome and check in with its beats as it runs</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">to get a feel for how the metronome works, try defining one at the REPL</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">nome</span> (metronome 200))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(nome)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">setup a tempo for our metronome to use</span>
(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">forty-bpm</span> (metronome 40))

<span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">this function will play our sound at whatever tempo we've set our metronome to </span>
(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">looper</span> [nome sound]    
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> [beat (nome)]
        (at (nome beat) (sound))
        (apply-by (nome (inc beat)) looper nome sound [])))

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">turn on the metronome </span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">uh, where is 'piano' anything defined?</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">foo</span> [t freq]
  (at t (sin1 freq))
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [next-t (+ t 3000)
        next-f (+ freq 10)]
    (apply-by next-t #'foo [next-t next-f])))

(foo (now) 40)
</pre>
</div>

<p>
this one, using sin1 as defined above, gradually steps up and up
through the frequencies from a given fundamental
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">foo</span> [t freq]
  (at t (sin1 freq))
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [next-t (+ t 6000)
        next-f (+ freq 10)]
    (apply-by next-t #'foo [next-t next-f])))

(foo (now) 40)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline50" class="outline-2">
<h2 id="orgheadline50"><span class="section-number-2">6</span> develop chords progressions (not "intro" enough&#x2013;should be moved elsewhere?)</h2>
<div class="outline-text-2" id="text-6">
<p>
Because I am interested in post-tonal music, the following is about
how to incorporate such sounds into overtone projects.
</p>
</div>
<div id="outline-container-orgheadline49" class="outline-3">
<h3 id="orgheadline49"><span class="section-number-3">6.1</span> start working with post tonal set classes</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-orgheadline48" class="outline-4">
<h4 id="orgheadline48"><span class="section-number-4">6.1.1</span> getting-started babel session</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
note, this will only work if&#x2026;you are in the proper namespace. What
that really means is&#x2026;don't do this. 
</p>

<p>
Make sure that your data is loaded in a namespace declaration, i.e.
don't call this. There is a general preference for using a different
idiom than the following, which is very easy, but obscures some things
about how namespaces work.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(load "set-class-data")</span>
</pre>
</div>

<p>
While the above seems so innocent, it fails to reveal anything about
where this file lives, which means you will be able to use things
defined in there with a false sense of security. "Everything just
works!" Until it doesn't. 
</p>

<p>
What should you do instead? Use <code>require</code> which will be described more
elsewhere [link]
</p>

<pre class="example">
nil
</pre>

<p>
#+COMMENT why do you want to hear an extremely high pitched sin wave?
</p>
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">definst</span> <span style="color: #93E0E3;">med96</span> [] (* 0.01 (sin-osc (midi-&gt;hz 96))))

(med96)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline52" class="outline-2">
<h2 id="orgheadline52"><span class="section-number-2">7</span> miscellaneous utilities and problems</h2>
