src/post_tonal_overtone/org_files/html-versions/first-steps.html
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">7.1</span> all caps is a problem&#x2013;clojure is case sensitive</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #BFEBBF;">LET</span> [<span style="color: #BFEBBF;">TIME</span> (<span style="color: #BFEBBF;">NOW</span>) ]
     (
      (<span style="color: #BFEBBF;">AT</span> (+ 0 <span style="color: #BFEBBF;">TIME</span>) (PLAYER-FN '(1 2 3)))
      (<span style="color: #BFEBBF;">AT</span> (+ 1000 <span style="color: #BFEBBF;">TIME</span>) (PLAYER-FN '(4 5 6)))))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">defn</span> <span style="color: #93E0E3;">chord-prog-time11</span> [player-fn]
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> [<span style="color: #BFEBBF;">TIME</span> (<span style="color: #BFEBBF;">NOW</span>) ] 
       (<span style="color: #BFEBBF;">AT</span> (+ 0 <span style="color: #BFEBBF;">TIME</span>) (PLAYER-FN '(68 81 46 50 88)))
       (<span style="color: #BFEBBF;">AT</span> (+ 1000 <span style="color: #BFEBBF;">TIME</span>) (PLAYER-FN '(80 69 46 73 86)))
       (<span style="color: #BFEBBF;">AT</span> (+ 2000 <span style="color: #BFEBBF;">TIME</span>) (PLAYER-FN '(68 59 48 85 64)))
       (<span style="color: #BFEBBF;">AT</span> (+ 3000 <span style="color: #BFEBBF;">TIME</span>) (PLAYER-FN '(68 69 72 87 52)))
       (<span style="color: #BFEBBF;">AT</span> (+ 4000 <span style="color: #BFEBBF;">TIME</span>) (PLAYER-FN '(89 55 45 60 62)))))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline54" class="outline-2">
<h2 id="orgheadline54"><span class="section-number-2">8</span> play piano in overtone</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline53" class="outline-3">
<h3 id="orgheadline53"><span class="section-number-3">8.1</span> </h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-clojure">(use '<span style="color: #7CB8BB;">overtone.live</span>)

(use '<span style="color: #7CB8BB;">overtone.inst.sampled-piano</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(midi-connected-devices)
</pre>
</div>

<pre class="example">
'((:description "Axiom A.I.R. Mini32 MIDI"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "MIDI"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "MIDI" "Axiom A.I.R. Mini32 MIDI" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x6fc3836b "MIDI")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x5e406927 "com.sun.media.sound.MidiInDevice@5e406927")  :version "Unknown version") (:description "Axiom A.I.R. Mini32 HyperControl"  :vendor "M-Audio"  :sinks 0  :sources 2147483647  :name "HyperControl"  :overtone.studio.midi/full-device-key (:midi-device "M-Audio" "HyperControl" "Axiom A.I.R. Mini32 HyperControl" 0)  :info #object(com.sun.media.sound.MidiInDeviceProvider$MidiInDeviceInfo 0x40d9b724 "HyperControl")  :overtone.studio.midi/dev-num 0  :device #object(com.sun.media.sound.MidiInDevice 0x534c9c7b "com.sun.media.sound.MidiInDevice@534c9c7b")  :version "Unknown version"))
</pre>

<div class="org-src-container">

<pre class="src src-clojure">(sampled-piano)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #DFAF8F;">piano-player</span> (midi-poly-player sampled-piano))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline55" class="outline-2">
<h2 id="orgheadline55"><span class="section-number-2">9</span> stop all playing sound</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-clojure">(stop)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: b</p>
<p class="date">Created: 2016-12-02 Fri 15:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
